smartel99/NilaiTFO/bsp/stm32l4xx_hal_sd.cpp
    When The compilation define USE_HAL_SD_REGISTER_CALLBACKS is set to 0 or
    not defined, the callback registering feature is not available
    and weak (surcharged) callbacks are used.

  @endverbatim
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2017 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                       opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
//#define NILAI_USE_FILESYSTEM
//#define NILAI_USES_STM32L4xx
//#define SDMMC1
//#define HAL_SD_MODULE_ENABLED
//#error Undefine these!

#if defined(NILAI_USE_FILESYSTEM) && defined(NILAI_USES_STM32L4xx)

#include "stm32l4xx_hal.h"

#if defined(SDMMC1)

/** @addtogroup STM32L4xx_HAL_Driver
 * @{
 */

/** @addtogroup SD
 * @{
 */

#ifdef HAL_SD_MODULE_ENABLED

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/** @addtogroup SD_Private_Defines
 * @{
 */

/**
 * @}
 */

/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
/* Private functions ---------------------------------------------------------*/
/** @defgroup SD_Private_Functions SD Private Functions
 * @{
 */
static uint32_t SD_InitCard(SD_HandleTypeDef* hsd);
static uint32_t SD_PowerON(SD_HandleTypeDef* hsd);
static uint32_t SD_SendSDStatus(SD_HandleTypeDef* hsd, uint32_t* pSDstatus);
static uint32_t SD_SendStatus(SD_HandleTypeDef* hsd, uint32_t* pCardStatus);
static uint32_t SD_WideBus_Enable(SD_HandleTypeDef* hsd);
static uint32_t SD_WideBus_Disable(SD_HandleTypeDef* hsd);
static uint32_t SD_FindSCR(SD_HandleTypeDef* hsd, uint32_t* pSCR);
static void     SD_PowerOFF(SD_HandleTypeDef* hsd);
static void     SD_Write_IT(SD_HandleTypeDef* hsd);
static void     SD_Read_IT(SD_HandleTypeDef* hsd);
#if !defined(STM32L4P5xx) && !defined(STM32L4Q5xx) && !defined(STM32L4R5xx) &&                     \
  !defined(STM32L4R7xx) && !defined(STM32L4R9xx) && !defined(STM32L4S5xx) &&                       \
  !defined(STM32L4S7xx) && !defined(STM32L4S9xx)
static void SD_DMATransmitCplt(DMA_HandleTypeDef* hdma);
static void SD_DMAReceiveCplt(DMA_HandleTypeDef* hdma);
static void SD_DMAError(DMA_HandleTypeDef* hdma);
static void SD_DMATxAbort(DMA_HandleTypeDef* hdma);
static void SD_DMARxAbort(DMA_HandleTypeDef* hdma);
#else
uint32_t        SD_HighSpeed(SD_HandleTypeDef* hsd);
static uint32_t SD_UltraHighSpeed(SD_HandleTypeDef* hsd);
static uint32_t SD_DDR_Mode(SD_HandleTypeDef* hsd);
#endif /* !STM32L4P5xx && !STM32L4Q5xx && !STM32L4R5xx && !STM32L4R7xx && !STM32L4R9xx &&          \
          !STM32L4S5xx && !STM32L4S7xx && !STM32L4S9xx */
/**
 * @}
 */

/* Exported functions --------------------------------------------------------*/
/** @addtogroup SD_Exported_Functions
 * @{
 */

/** @addtogroup SD_Exported_Functions_Group1
 *  @brief   Initialization and de-initialization functions
 *
@verbatim
  ==============================================================================
          ##### Initialization and de-initialization functions #####
  ==============================================================================
  [..]
    This section provides functions allowing to initialize/de-initialize the SD
    card device to be ready for use.

@endverbatim
  * @{
  */

/**
  * @brief  Initializes the SD according to the specified parameters in the
            SD_HandleTypeDef and create the associated handle.
  * @param  hsd Pointer to the SD handle
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_SD_Init(SD_HandleTypeDef* hsd)
{
#if defined(STM32L4P5xx) || defined(STM32L4Q5xx) || defined(STM32L4R5xx) ||                        \
  defined(STM32L4R7xx) || defined(STM32L4R9xx) || defined(STM32L4S5xx) || defined(STM32L4S7xx) ||  \
  defined(STM32L4S9xx)
    HAL_SD_CardStatusTypeDef CardStatus;
    uint32_t                 speedgrade, unitsize;
    uint32_t                 tickstart;
#endif

    /* Check the SD handle allocation */
    if (hsd == NULL)
    {
        return HAL_ERROR;
    }

    /* Check the parameters */
    assert_param(IS_SDMMC_ALL_INSTANCE(hsd->Instance));
    assert_param(IS_SDMMC_CLOCK_EDGE(hsd->Init.ClockEdge));
#if !defined(STM32L4P5xx) && !defined(STM32L4Q5xx) && !defined(STM32L4R5xx) &&                     \
  !defined(STM32L4R7xx) && !defined(STM32L4R9xx) && !defined(STM32L4S5xx) &&                       \
  !defined(STM32L4S7xx) && !defined(STM32L4S9xx)
    assert_param(IS_SDMMC_CLOCK_BYPASS(hsd->Init.ClockBypass));
#endif /* !STM32L4P5xx && !STM32L4Q5xx && !STM32L4R5xx && !STM32L4R7xx && !STM32L4R9xx &&          \
          !STM32L4S5xx && !STM32L4S7xx && !STM32L4S9xx */
    assert_param(IS_SDMMC_CLOCK_POWER_SAVE(hsd->Init.ClockPowerSave));
    assert_param(IS_SDMMC_BUS_WIDE(hsd->Init.BusWide));
    assert_param(IS_SDMMC_HARDWARE_FLOW_CONTROL(hsd->Init.HardwareFlowControl));
    assert_param(IS_SDMMC_CLKDIV(hsd->Init.ClockDiv));

    if (hsd->State == HAL_SD_STATE_RESET)
    {
        /* Allocate lock resource and initialize it */
        hsd->Lock = HAL_UNLOCKED;
#if defined(USE_HAL_SD_REGISTER_CALLBACKS) && (USE_HAL_SD_REGISTER_CALLBACKS == 1U)
        /* Reset Callback pointers in HAL_SD_STATE_RESET only */
        hsd->TxCpltCallback    = HAL_SD_TxCpltCallback;
        hsd->RxCpltCallback    = HAL_SD_RxCpltCallback;
        hsd->ErrorCallback     = HAL_SD_ErrorCallback;
        hsd->AbortCpltCallback = HAL_SD_AbortCallback;
#if defined(STM32L4P5xx) || defined(STM32L4Q5xx) || defined(STM32L4R5xx) ||                        \
  defined(STM32L4R7xx) || defined(STM32L4R9xx) || defined(STM32L4S5xx) || defined(STM32L4S7xx) ||  \
  defined(STM32L4S9xx)
        hsd->Read_DMADblBuf0CpltCallback    = HAL_SDEx_Read_DMADoubleBuffer0CpltCallback;
        hsd->Read_DMADblBuf1CpltCallback    = HAL_SDEx_Read_DMADoubleBuffer1CpltCallback;
        hsd->Write_DMADblBuf0CpltCallback   = HAL_SDEx_Write_DMADoubleBuffer0CpltCallback;
        hsd->Write_DMADblBuf1CpltCallback   = HAL_SDEx_Write_DMADoubleBuffer1CpltCallback;
        hsd->DriveTransceiver_1_8V_Callback = HAL_SDEx_DriveTransceiver_1_8V_Callback;
#endif

        if (hsd->MspInitCallback == NULL)
        {
            hsd->MspInitCallback = HAL_SD_MspInit;
        }

        /* Init the low level hardware */
        hsd->MspInitCallback(hsd);
#else
        /* Init the low level hardware : GPIO, CLOCK, CORTEX...etc */
        HAL_SD_MspInit(hsd);
#endif /* USE_HAL_SD_REGISTER_CALLBACKS */
    }

    hsd->State = HAL_SD_STATE_BUSY;

