smartel99/NilaiTFO/bsp/stm32l4xx_hal_sd.cpp
    /* Initialize the Card parameters */
    if (HAL_SD_InitCard(hsd) != HAL_OK)
    {
        return HAL_ERROR;
    }

#if defined(STM32L4P5xx) || defined(STM32L4Q5xx) || defined(STM32L4R5xx) ||                        \
  defined(STM32L4R7xx) || defined(STM32L4R9xx) || defined(STM32L4S5xx) || defined(STM32L4S7xx) ||  \
  defined(STM32L4S9xx)
    if (HAL_SD_GetCardStatus(hsd, &CardStatus) != HAL_OK)
    {
        return HAL_ERROR;
    }
    /* Get Initial Card Speed from Card Status*/
    speedgrade = CardStatus.UhsSpeedGrade;
    unitsize   = CardStatus.UhsAllocationUnitSize;
    if ((hsd->SdCard.CardType == CARD_SDHC_SDXC) && ((speedgrade != 0U) || (unitsize != 0U)))
    {
        hsd->SdCard.CardSpeed = CARD_ULTRA_HIGH_SPEED;
    }
    else
    {
        if (hsd->SdCard.CardType == CARD_SDHC_SDXC)
        {
            hsd->SdCard.CardSpeed = CARD_HIGH_SPEED;
        }
        else
        {
            hsd->SdCard.CardSpeed = CARD_NORMAL_SPEED;
        }
    }
    /* Configure the bus wide */
    if (HAL_SD_ConfigWideBusOperation(hsd, hsd->Init.BusWide) != HAL_OK)
    {
        return HAL_ERROR;
    }

    /* Verify that SD card is ready to use after Initialization */
    tickstart = HAL_GetTick();
    while ((HAL_SD_GetCardState(hsd) != HAL_SD_CARD_TRANSFER))
    {
        if ((HAL_GetTick() - tickstart) >= SDMMC_DATATIMEOUT)
        {
            hsd->ErrorCode = HAL_SD_ERROR_TIMEOUT;
            hsd->State     = HAL_SD_STATE_READY;
            return HAL_TIMEOUT;
        }
    }
#endif /* STM32L4P5xx || STM32L4Q5xx || STM32L4R5xx || STM32L4R7xx || STM32L4R9xx || STM32L4S5xx   \
          || STM32L4S7xx || STM32L4S9xx */

    /* Initialize the error code */
    hsd->ErrorCode = HAL_SD_ERROR_NONE;

    /* Initialize the SD operation */
    hsd->Context = SD_CONTEXT_NONE;

    /* Initialize the SD state */
    hsd->State = HAL_SD_STATE_READY;

    return HAL_OK;
}

/**
  * @brief  Initializes the SD Card.
  * @param  hsd Pointer to SD handle
  * @note   This function initializes the SD card. It could be used when a card
            re-initialization is needed.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_SD_InitCard(SD_HandleTypeDef* hsd)
{
    uint32_t          errorstate;
    HAL_StatusTypeDef status;
    SD_InitTypeDef    Init;
    uint32_t          sdmmc_clk;

    /* Default SDMMC peripheral configuration for SD card initialization */
    Init.ClockEdge = SDMMC_CLOCK_EDGE_RISING;
#if !defined(STM32L4P5xx) && !defined(STM32L4Q5xx) && !defined(STM32L4R5xx) &&                     \
  !defined(STM32L4R7xx) && !defined(STM32L4R9xx) && !defined(STM32L4S5xx) &&                       \
  !defined(STM32L4S7xx) && !defined(STM32L4S9xx)
    Init.ClockBypass = SDMMC_CLOCK_BYPASS_DISABLE;
#endif /* !STM32L4P5xx && !STM32L4Q5xx && !STM32L4R5xx && !STM32L4R7xx && !STM32L4R9xx &&          \
          !STM32L4S5xx && !STM32L4S7xx && !STM32L4S9xx */
    Init.ClockPowerSave      = SDMMC_CLOCK_POWER_SAVE_DISABLE;
    Init.BusWide             = SDMMC_BUS_WIDE_1B;
    Init.HardwareFlowControl = SDMMC_HARDWARE_FLOW_CONTROL_DISABLE;

    /* Init Clock should be less or equal to 400Khz*/
    sdmmc_clk = HAL_RCCEx_GetPeriphCLKFreq(RCC_PERIPHCLK_SDMMC1);
    if (sdmmc_clk == 0U)
    {
        hsd->State     = HAL_SD_STATE_READY;
        hsd->ErrorCode = SDMMC_ERROR_INVALID_PARAMETER;
        return HAL_ERROR;
    }
#if !defined(STM32L4P5xx) && !defined(STM32L4Q5xx) && !defined(STM32L4R5xx) &&                     \
  !defined(STM32L4R7xx) && !defined(STM32L4R9xx) && !defined(STM32L4S5xx) &&                       \
  !defined(STM32L4S7xx) && !defined(STM32L4S9xx)
    Init.ClockDiv = ((sdmmc_clk / 400000U) - 2U);
#else
    Init.ClockDiv = sdmmc_clk / (2U * 400000U);
#endif

#if defined(STM32L4P5xx) || defined(STM32L4Q5xx) || defined(STM32L4R5xx) ||                        \
  defined(STM32L4R7xx) || defined(STM32L4R9xx) || defined(STM32L4S5xx) || defined(STM32L4S7xx) ||  \
  defined(STM32L4S9xx)
    if (hsd->Init.Transceiver == SDMMC_TRANSCEIVER_ENABLE)
    {
        /* Set Transceiver polarity */
        hsd->Instance->POWER |= SDMMC_POWER_DIRPOL;
    }
#endif /* STM32L4P5xx || STM32L4Q5xx || STM32L4R5xx || STM32L4R7xx || STM32L4R9xx || STM32L4S5xx   \
          || STM32L4S7xx || STM32L4S9xx */

    /* Initialize SDMMC peripheral interface with default configuration */
    status = SDMMC_Init(hsd->Instance, Init);
    if (status != HAL_OK)
    {
        return HAL_ERROR;
    }

#if !defined(STM32L4P5xx) && !defined(STM32L4Q5xx) && !defined(STM32L4R5xx) &&                     \
  !defined(STM32L4R7xx) && !defined(STM32L4R9xx) && !defined(STM32L4S5xx) &&                       \
  !defined(STM32L4S7xx) && !defined(STM32L4S9xx)
    /* Disable SDMMC Clock */
    __HAL_SD_DISABLE(hsd);
#endif /* !STM32L4P5xx && !STM32L4Q5xx && !STM32L4R5xx && !STM32L4R7xx && !STM32L4R9xx &&          \
          !STM32L4S5xx && !STM32L4S7xx && !STM32L4S9xx */

    /* Set Power State to ON */
    status = SDMMC_PowerState_ON(hsd->Instance);
    if (status != HAL_OK)
    {
        return HAL_ERROR;
    }

#if !defined(STM32L4P5xx) && !defined(STM32L4Q5xx) && !defined(STM32L4R5xx) &&                     \
  !defined(STM32L4R7xx) && !defined(STM32L4R9xx) && !defined(STM32L4S5xx) &&                       \
  !defined(STM32L4S7xx) && !defined(STM32L4S9xx)
    /* Enable SDMMC Clock */
    __HAL_SD_ENABLE(hsd);
#endif /* !STM32L4P5xx && !STM32L4Q5xx && !STM32L4R5xx && !STM32L4R7xx && !STM32L4R9xx &&          \
          !STM32L4S5xx && !STM32L4S7xx && !STM32L4S9xx */

    /* wait 74 Cycles: required power up waiting time before starting
       the SD initialization sequence */
#if !defined(STM32L4P5xx) && !defined(STM32L4Q5xx) && !defined(STM32L4R5xx) &&                     \
  !defined(STM32L4R7xx) && !defined(STM32L4R9xx) && !defined(STM32L4S5xx) &&                       \
  !defined(STM32L4S7xx) && !defined(STM32L4S9xx)
    sdmmc_clk = sdmmc_clk / (Init.ClockDiv + 2U);
#else
    sdmmc_clk     = sdmmc_clk / (2U * Init.ClockDiv);
#endif
    HAL_Delay(1U + (74U * 1000U / (sdmmc_clk)));

    /* Identify card operating voltage */
    errorstate = SD_PowerON(hsd);
    if (errorstate != HAL_SD_ERROR_NONE)
    {
        hsd->State = HAL_SD_STATE_READY;
        hsd->ErrorCode |= errorstate;
        return HAL_ERROR;
    }

    /* Card initialization */
    errorstate = SD_InitCard(hsd);
    if (errorstate != HAL_SD_ERROR_NONE)
    {
        hsd->State = HAL_SD_STATE_READY;
        hsd->ErrorCode |= errorstate;
        return HAL_ERROR;
    }

    /* Set Block Size for Card */
    errorstate = SDMMC_CmdBlockLength(hsd->Instance, BLOCKSIZE);
    if (errorstate != HAL_SD_ERROR_NONE)
    {
        /* Clear all the static flags */
        __HAL_SD_CLEAR_FLAG(hsd, SDMMC_STATIC_FLAGS);
        hsd->ErrorCode |= errorstate;
        hsd->State = HAL_SD_STATE_READY;
        return HAL_ERROR;
    }

    return HAL_OK;
}

/**
 * @brief  De-Initializes the SD card.
 * @param  hsd Pointer to SD handle
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_SD_DeInit(SD_HandleTypeDef* hsd)
{
    /* Check the SD handle allocation */
    if (hsd == NULL)
    {
        return HAL_ERROR;
    }

    /* Check the parameters */
    assert_param(IS_SDMMC_ALL_INSTANCE(hsd->Instance));

    hsd->State = HAL_SD_STATE_BUSY;

#if defined(STM32L4P5xx) || defined(STM32L4Q5xx) || defined(STM32L4R5xx) ||                        \
  defined(STM32L4R7xx) || defined(STM32L4R9xx) || defined(STM32L4S5xx) || defined(STM32L4S7xx) ||  \
  defined(STM32L4S9xx)
    /* Desactivate the 1.8V Mode */
    if (hsd->Init.Transceiver == SDMMC_TRANSCEIVER_ENABLE)
    {
#if defined(USE_HAL_SD_REGISTER_CALLBACKS) && (USE_HAL_SD_REGISTER_CALLBACKS == 1U)
        if (hsd->DriveTransceiver_1_8V_Callback == NULL)
        {
            hsd->DriveTransceiver_1_8V_Callback = HAL_SDEx_DriveTransceiver_1_8V_Callback;
        }
        hsd->DriveTransceiver_1_8V_Callback(RESET);
#else
        HAL_SDEx_DriveTransceiver_1_8V_Callback(RESET);
#endif /* USE_HAL_SD_REGISTER_CALLBACKS */
    }
#endif

    /* Set SD power state to off */
    SD_PowerOFF(hsd);

#if defined(USE_HAL_SD_REGISTER_CALLBACKS) && (USE_HAL_SD_REGISTER_CALLBACKS == 1U)
    if (hsd->MspDeInitCallback == NULL)
    {
        hsd->MspDeInitCallback = HAL_SD_MspDeInit;
    }

