smartel99/NilaiTFO/bsp/stm32l4xx_hal_sd.cpp
    /* DeInit the low level hardware */
    hsd->MspDeInitCallback(hsd);
#else
    /* De-Initialize the MSP layer */
    HAL_SD_MspDeInit(hsd);
#endif /* USE_HAL_SD_REGISTER_CALLBACKS */

    hsd->ErrorCode = HAL_SD_ERROR_NONE;
    hsd->State     = HAL_SD_STATE_RESET;

    return HAL_OK;
}


/**
 * @brief  Initializes the SD MSP.
 * @param  hsd Pointer to SD handle
 * @retval None
 */
__weak void HAL_SD_MspInit(SD_HandleTypeDef* hsd)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hsd);

    /* NOTE : This function should not be modified, when the callback is needed,
              the HAL_SD_MspInit could be implemented in the user file
     */
}

/**
 * @brief  De-Initialize SD MSP.
 * @param  hsd Pointer to SD handle
 * @retval None
 */
__weak void HAL_SD_MspDeInit(SD_HandleTypeDef* hsd)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hsd);

    /* NOTE : This function should not be modified, when the callback is needed,
              the HAL_SD_MspDeInit could be implemented in the user file
     */
}

/**
 * @}
 */

/** @addtogroup SD_Exported_Functions_Group2
 *  @brief   Data transfer functions
 *
@verbatim
  ==============================================================================
                        ##### IO operation functions #####
  ==============================================================================
  [..]
    This subsection provides a set of functions allowing to manage the data
    transfer from/to SD card.

@endverbatim
  * @{
  */

/**
 * @brief  Reads block(s) from a specified address in a card. The Data transfer
 *         is managed by polling mode.
 * @note   This API should be followed by a check on the card state through
 *         HAL_SD_GetCardState().
 * @param  hsd Pointer to SD handle
 * @param  pData pointer to the buffer that will contain the received data
 * @param  BlockAdd Block Address from where data is to be read
 * @param  NumberOfBlocks Number of SD blocks to read
 * @param  Timeout Specify timeout value
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_SD_ReadBlocks(SD_HandleTypeDef* hsd,
                                    uint8_t*          pData,
                                    uint32_t          BlockAdd,
                                    uint32_t          NumberOfBlocks,
                                    uint32_t          Timeout)
{
    SDMMC_DataInitTypeDef config;
    uint32_t              errorstate;
    uint32_t              tickstart = HAL_GetTick();
    uint32_t              count, data, dataremaining;
    uint32_t              add      = BlockAdd;
    uint8_t*              tempbuff = pData;

    if (NULL == pData)
    {
        hsd->ErrorCode |= HAL_SD_ERROR_PARAM;
        return HAL_ERROR;
    }

    if (hsd->State == HAL_SD_STATE_READY)
    {
        hsd->ErrorCode = HAL_SD_ERROR_NONE;

        if ((add + NumberOfBlocks) > (hsd->SdCard.LogBlockNbr))
        {
            hsd->ErrorCode |= HAL_SD_ERROR_ADDR_OUT_OF_RANGE;
            return HAL_ERROR;
        }

        hsd->State = HAL_SD_STATE_BUSY;

        /* Initialize data control register */
        hsd->Instance->DCTRL = 0U;

        if (hsd->SdCard.CardType != CARD_SDHC_SDXC)
        {
            add *= 512U;
        }

        /* Configure the SD DPSM (Data Path State Machine) */
        config.DataTimeOut   = SDMMC_DATATIMEOUT;
        config.DataLength    = NumberOfBlocks * BLOCKSIZE;
        config.DataBlockSize = SDMMC_DATABLOCK_SIZE_512B;
        config.TransferDir   = SDMMC_TRANSFER_DIR_TO_SDMMC;
        config.TransferMode  = SDMMC_TRANSFER_MODE_BLOCK;
#if defined(STM32L4P5xx) || defined(STM32L4Q5xx) || defined(STM32L4R5xx) ||                        \
  defined(STM32L4R7xx) || defined(STM32L4R9xx) || defined(STM32L4S5xx) || defined(STM32L4S7xx) ||  \
  defined(STM32L4S9xx)
        config.DPSM = SDMMC_DPSM_DISABLE;
#else
        config.DPSM     = SDMMC_DPSM_ENABLE;
#endif /* STM32L4P5xx || STM32L4Q5xx || STM32L4R5xx || STM32L4R7xx || STM32L4R9xx || STM32L4S5xx   \
          || STM32L4S7xx || STM32L4S9xx */
        (void)SDMMC_ConfigData(hsd->Instance, &config);
#if defined(STM32L4P5xx) || defined(STM32L4Q5xx) || defined(STM32L4R5xx) ||                        \
  defined(STM32L4R7xx) || defined(STM32L4R9xx) || defined(STM32L4S5xx) || defined(STM32L4S7xx) ||  \
  defined(STM32L4S9xx)
        __SDMMC_CMDTRANS_ENABLE(hsd->Instance);
#endif /* STM32L4P5xx || STM32L4Q5xx || STM32L4R5xx || STM32L4R7xx || STM32L4R9xx || STM32L4S5xx   \
          || STM32L4S7xx || STM32L4S9xx */

        /* Read block(s) in polling mode */
        if (NumberOfBlocks > 1U)
        {
            hsd->Context = SD_CONTEXT_READ_MULTIPLE_BLOCK;

            /* Read Multi Block command */
            errorstate = SDMMC_CmdReadMultiBlock(hsd->Instance, add);
        }
        else
        {
            hsd->Context = SD_CONTEXT_READ_SINGLE_BLOCK;

            /* Read Single Block command */
            errorstate = SDMMC_CmdReadSingleBlock(hsd->Instance, add);
        }
        if (errorstate != HAL_SD_ERROR_NONE)
        {
            /* Clear all the static flags */
            __HAL_SD_CLEAR_FLAG(hsd, SDMMC_STATIC_FLAGS);
            hsd->ErrorCode |= errorstate;
            hsd->State   = HAL_SD_STATE_READY;
            hsd->Context = SD_CONTEXT_NONE;
            return HAL_ERROR;
        }

        /* Poll on SDMMC flags */
        dataremaining = config.DataLength;
        while (!__HAL_SD_GET_FLAG(hsd,
                                  SDMMC_FLAG_RXOVERR | SDMMC_FLAG_DCRCFAIL | SDMMC_FLAG_DTIMEOUT |
                                    SDMMC_FLAG_DATAEND))
        {
            if (__HAL_SD_GET_FLAG(hsd, SDMMC_FLAG_RXFIFOHF) && (dataremaining > 0U))
            {
                /* Read data from SDMMC Rx FIFO */
                for (count = 0U; count < 8U; count++)
                {
                    data      = SDMMC_ReadFIFO(hsd->Instance);
                    *tempbuff = (uint8_t)(data & 0xFFU);
                    tempbuff++;
                    dataremaining--;
                    *tempbuff = (uint8_t)((data >> 8U) & 0xFFU);
                    tempbuff++;
                    dataremaining--;
                    *tempbuff = (uint8_t)((data >> 16U) & 0xFFU);
                    tempbuff++;
                    dataremaining--;
                    *tempbuff = (uint8_t)((data >> 24U) & 0xFFU);
                    tempbuff++;
                    dataremaining--;
                }
            }

            if (((HAL_GetTick() - tickstart) >= Timeout) || (Timeout == 0U))
            {
                /* Clear all the static flags */
                __HAL_SD_CLEAR_FLAG(hsd, SDMMC_STATIC_FLAGS);
                hsd->ErrorCode |= HAL_SD_ERROR_TIMEOUT;
                hsd->State   = HAL_SD_STATE_READY;
                hsd->Context = SD_CONTEXT_NONE;
                return HAL_TIMEOUT;
            }
        }
#if defined(STM32L4P5xx) || defined(STM32L4Q5xx) || defined(STM32L4R5xx) ||                        \
  defined(STM32L4R7xx) || defined(STM32L4R9xx) || defined(STM32L4S5xx) || defined(STM32L4S7xx) ||  \
  defined(STM32L4S9xx)
        __SDMMC_CMDTRANS_DISABLE(hsd->Instance);
#endif /* STM32L4P5xx || STM32L4Q5xx || STM32L4R5xx || STM32L4R7xx || STM32L4R9xx || STM32L4S5xx   \
          || STM32L4S7xx || STM32L4S9xx */

        /* Send stop transmission command in case of multiblock read */
        if (__HAL_SD_GET_FLAG(hsd, SDMMC_FLAG_DATAEND) && (NumberOfBlocks > 1U))
        {
            if (hsd->SdCard.CardType != CARD_SECURED)
            {
                /* Send stop transmission command */
                errorstate = SDMMC_CmdStopTransfer(hsd->Instance);
                if (errorstate != HAL_SD_ERROR_NONE)
                {
                    /* Clear all the static flags */
                    __HAL_SD_CLEAR_FLAG(hsd, SDMMC_STATIC_FLAGS);
                    hsd->ErrorCode |= errorstate;
                    hsd->State   = HAL_SD_STATE_READY;
                    hsd->Context = SD_CONTEXT_NONE;
                    return HAL_ERROR;
                }
            }
        }

        /* Get error state */
        if (__HAL_SD_GET_FLAG(hsd, SDMMC_FLAG_DTIMEOUT))
        {
            /* Clear all the static flags */
            __HAL_SD_CLEAR_FLAG(hsd, SDMMC_STATIC_FLAGS);
            hsd->ErrorCode |= HAL_SD_ERROR_DATA_TIMEOUT;
            hsd->State   = HAL_SD_STATE_READY;
            hsd->Context = SD_CONTEXT_NONE;
            return HAL_ERROR;
        }
        else if (__HAL_SD_GET_FLAG(hsd, SDMMC_FLAG_DCRCFAIL))
        {
            /* Clear all the static flags */
            __HAL_SD_CLEAR_FLAG(hsd, SDMMC_STATIC_FLAGS);
            hsd->ErrorCode |= HAL_SD_ERROR_DATA_CRC_FAIL;
            hsd->State   = HAL_SD_STATE_READY;
            hsd->Context = SD_CONTEXT_NONE;
            return HAL_ERROR;
        }
        else if (__HAL_SD_GET_FLAG(hsd, SDMMC_FLAG_RXOVERR))
        {
            /* Clear all the static flags */
            __HAL_SD_CLEAR_FLAG(hsd, SDMMC_STATIC_FLAGS);
            hsd->ErrorCode |= HAL_SD_ERROR_RX_OVERRUN;
            hsd->State   = HAL_SD_STATE_READY;
            hsd->Context = SD_CONTEXT_NONE;
            return HAL_ERROR;
        }
        else
        {
            /* Nothing to do */
        }

#if !defined(STM32L4P5xx) && !defined(STM32L4Q5xx) && !defined(STM32L4R5xx) &&                     \
  !defined(STM32L4R7xx) && !defined(STM32L4R9xx) && !defined(STM32L4S5xx) &&                       \
  !defined(STM32L4S7xx) && !defined(STM32L4S9xx)
        /* Empty FIFO if there is still any data */
        while ((__HAL_SD_GET_FLAG(hsd, SDMMC_FLAG_RXDAVL)) && (dataremaining > 0U))
        {
            data      = SDMMC_ReadFIFO(hsd->Instance);
            *tempbuff = (uint8_t)(data & 0xFFU);
            tempbuff++;
            dataremaining--;
            *tempbuff = (uint8_t)((data >> 8U) & 0xFFU);
            tempbuff++;
            dataremaining--;
            *tempbuff = (uint8_t)((data >> 16U) & 0xFFU);
            tempbuff++;
            dataremaining--;
            *tempbuff = (uint8_t)((data >> 24U) & 0xFFU);
            tempbuff++;
            dataremaining--;

            if (((HAL_GetTick() - tickstart) >= Timeout) || (Timeout == 0U))
            {
                /* Clear all the static flags */
                __HAL_SD_CLEAR_FLAG(hsd, SDMMC_STATIC_FLAGS);
                hsd->ErrorCode |= HAL_SD_ERROR_TIMEOUT;
                hsd->State   = HAL_SD_STATE_READY;
                hsd->Context = SD_CONTEXT_NONE;
                return HAL_ERROR;
            }
        }
#endif /* !STM32L4P5xx && !STM32L4Q5xx && !STM32L4R5xx && !STM32L4R7xx && !STM32L4R9xx &&          \
          !STM32L4S5xx && !STM32L4S7xx && !STM32L4S9xx */

        /* Clear all the static flags */
        __HAL_SD_CLEAR_FLAG(hsd, SDMMC_STATIC_DATA_FLAGS);

        hsd->State = HAL_SD_STATE_READY;

        return HAL_OK;
    }
    else
    {
        hsd->ErrorCode |= HAL_SD_ERROR_BUSY;
        return HAL_ERROR;
    }
}

/**
 * @brief  Allows to write block(s) to a specified address in a card. The Data
 *         transfer is managed by polling mode.
 * @note   This API should be followed by a check on the card state through
 *         HAL_SD_GetCardState().
 * @param  hsd Pointer to SD handle
 * @param  pData pointer to the buffer that will contain the data to transmit
 * @param  BlockAdd Block Address where data will be written
 * @param  NumberOfBlocks Number of SD blocks to write
 * @param  Timeout Specify timeout value
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_SD_WriteBlocks(SD_HandleTypeDef* hsd,
                                     uint8_t*          pData,
                                     uint32_t          BlockAdd,
                                     uint32_t          NumberOfBlocks,
                                     uint32_t          Timeout)
{
    SDMMC_DataInitTypeDef config;
    uint32_t              errorstate;
    uint32_t              tickstart = HAL_GetTick();
    uint32_t              count, data, dataremaining;
    uint32_t              add      = BlockAdd;
    uint8_t*              tempbuff = pData;

    if (NULL == pData)
    {
        hsd->ErrorCode |= HAL_SD_ERROR_PARAM;
        return HAL_ERROR;
    }

    if (hsd->State == HAL_SD_STATE_READY)
    {
        hsd->ErrorCode = HAL_SD_ERROR_NONE;

        if ((add + NumberOfBlocks) > (hsd->SdCard.LogBlockNbr))
        {
            hsd->ErrorCode |= HAL_SD_ERROR_ADDR_OUT_OF_RANGE;
            return HAL_ERROR;
        }

        hsd->State = HAL_SD_STATE_BUSY;

        /* Initialize data control register */
        hsd->Instance->DCTRL = 0U;

        if (hsd->SdCard.CardType != CARD_SDHC_SDXC)
        {
            add *= 512U;
        }

        /* Configure the SD DPSM (Data Path State Machine) */
        config.DataTimeOut   = SDMMC_DATATIMEOUT;
        config.DataLength    = NumberOfBlocks * BLOCKSIZE;
        config.DataBlockSize = SDMMC_DATABLOCK_SIZE_512B;
        config.TransferDir   = SDMMC_TRANSFER_DIR_TO_CARD;
        config.TransferMode  = SDMMC_TRANSFER_MODE_BLOCK;
#if defined(STM32L4P5xx) || defined(STM32L4Q5xx) || defined(STM32L4R5xx) ||                        \
  defined(STM32L4R7xx) || defined(STM32L4R9xx) || defined(STM32L4S5xx) || defined(STM32L4S7xx) ||  \
  defined(STM32L4S9xx)
        config.DPSM = SDMMC_DPSM_DISABLE;
#else
        config.DPSM     = SDMMC_DPSM_ENABLE;
#endif /* STM32L4P5xx || STM32L4Q5xx || STM32L4R5xx || STM32L4R7xx || STM32L4R9xx || STM32L4S5xx   \
          || STM32L4S7xx || STM32L4S9xx */
        (void)SDMMC_ConfigData(hsd->Instance, &config);
#if defined(STM32L4P5xx) || defined(STM32L4Q5xx) || defined(STM32L4R5xx) ||                        \
  defined(STM32L4R7xx) || defined(STM32L4R9xx) || defined(STM32L4S5xx) || defined(STM32L4S7xx) ||  \
  defined(STM32L4S9xx)
        __SDMMC_CMDTRANS_ENABLE(hsd->Instance);
#endif /* STM32L4P5xx || STM32L4Q5xx || STM32L4R5xx || STM32L4R7xx || STM32L4R9xx || STM32L4S5xx   \
          || STM32L4S7xx || STM32L4S9xx */

        /* Write Blocks in Polling mode */
        if (NumberOfBlocks > 1U)
        {
            hsd->Context = SD_CONTEXT_WRITE_MULTIPLE_BLOCK;

