smartel99/NilaiTFO/bsp/stm32l4xx_hal_sd.cpp
            /* Write Multi Block command */
            errorstate = SDMMC_CmdWriteMultiBlock(hsd->Instance, add);
        }
        else
        {
            hsd->Context = SD_CONTEXT_WRITE_SINGLE_BLOCK;

            /* Write Single Block command */
            errorstate = SDMMC_CmdWriteSingleBlock(hsd->Instance, add);
        }
        if (errorstate != HAL_SD_ERROR_NONE)
        {
            /* Clear all the static flags */
            __HAL_SD_CLEAR_FLAG(hsd, SDMMC_STATIC_FLAGS);
            hsd->ErrorCode |= errorstate;
            hsd->State   = HAL_SD_STATE_READY;
            hsd->Context = SD_CONTEXT_NONE;
            return HAL_ERROR;
        }

        /* Write block(s) in polling mode */
        dataremaining = config.DataLength;
        while (!__HAL_SD_GET_FLAG(hsd,
                                  SDMMC_FLAG_TXUNDERR | SDMMC_FLAG_DCRCFAIL | SDMMC_FLAG_DTIMEOUT |
                                    SDMMC_FLAG_DATAEND))
        {
            if (__HAL_SD_GET_FLAG(hsd, SDMMC_FLAG_TXFIFOHE) && (dataremaining > 0U))
            {
                /* Write data to SDMMC Tx FIFO */
                for (count = 0U; count < 8U; count++)
                {
                    data = (uint32_t)(*tempbuff);
                    tempbuff++;
                    dataremaining--;
                    data |= ((uint32_t)(*tempbuff) << 8U);
                    tempbuff++;
                    dataremaining--;
                    data |= ((uint32_t)(*tempbuff) << 16U);
                    tempbuff++;
                    dataremaining--;
                    data |= ((uint32_t)(*tempbuff) << 24U);
                    tempbuff++;
                    dataremaining--;
                    (void)SDMMC_WriteFIFO(hsd->Instance, &data);
                }
            }

            if (((HAL_GetTick() - tickstart) >= Timeout) || (Timeout == 0U))
            {
                /* Clear all the static flags */
                __HAL_SD_CLEAR_FLAG(hsd, SDMMC_STATIC_FLAGS);
                hsd->ErrorCode |= errorstate;
                hsd->State   = HAL_SD_STATE_READY;
                hsd->Context = SD_CONTEXT_NONE;
                return HAL_TIMEOUT;
            }
        }
#if defined(STM32L4P5xx) || defined(STM32L4Q5xx) || defined(STM32L4R5xx) ||                        \
  defined(STM32L4R7xx) || defined(STM32L4R9xx) || defined(STM32L4S5xx) || defined(STM32L4S7xx) ||  \
  defined(STM32L4S9xx)
        __SDMMC_CMDTRANS_DISABLE(hsd->Instance);
#endif /* STM32L4P5xx || STM32L4Q5xx || STM32L4R5xx || STM32L4R7xx || STM32L4R9xx || STM32L4S5xx   \
          || STM32L4S7xx || STM32L4S9xx */

        /* Send stop transmission command in case of multiblock write */
        if (__HAL_SD_GET_FLAG(hsd, SDMMC_FLAG_DATAEND) && (NumberOfBlocks > 1U))
        {
            if (hsd->SdCard.CardType != CARD_SECURED)
            {
                /* Send stop transmission command */
                errorstate = SDMMC_CmdStopTransfer(hsd->Instance);
                if (errorstate != HAL_SD_ERROR_NONE)
                {
                    /* Clear all the static flags */
                    __HAL_SD_CLEAR_FLAG(hsd, SDMMC_STATIC_FLAGS);
                    hsd->ErrorCode |= errorstate;
                    hsd->State   = HAL_SD_STATE_READY;
                    hsd->Context = SD_CONTEXT_NONE;
                    return HAL_ERROR;
                }
            }
        }

        /* Get error state */
        if (__HAL_SD_GET_FLAG(hsd, SDMMC_FLAG_DTIMEOUT))
        {
            /* Clear all the static flags */
            __HAL_SD_CLEAR_FLAG(hsd, SDMMC_STATIC_FLAGS);
            hsd->ErrorCode |= HAL_SD_ERROR_DATA_TIMEOUT;
            hsd->State   = HAL_SD_STATE_READY;
            hsd->Context = SD_CONTEXT_NONE;
            return HAL_ERROR;
        }
        else if (__HAL_SD_GET_FLAG(hsd, SDMMC_FLAG_DCRCFAIL))
        {
            /* Clear all the static flags */
            __HAL_SD_CLEAR_FLAG(hsd, SDMMC_STATIC_FLAGS);
            hsd->ErrorCode |= HAL_SD_ERROR_DATA_CRC_FAIL;
            hsd->State   = HAL_SD_STATE_READY;
            hsd->Context = SD_CONTEXT_NONE;
            return HAL_ERROR;
        }
        else if (__HAL_SD_GET_FLAG(hsd, SDMMC_FLAG_TXUNDERR))
        {
            /* Clear all the static flags */
            __HAL_SD_CLEAR_FLAG(hsd, SDMMC_STATIC_FLAGS);
            hsd->ErrorCode |= HAL_SD_ERROR_TX_UNDERRUN;
            hsd->State   = HAL_SD_STATE_READY;
            hsd->Context = SD_CONTEXT_NONE;
            return HAL_ERROR;
        }
        else
        {
            /* Nothing to do */
        }

        /* Clear all the static flags */
        __HAL_SD_CLEAR_FLAG(hsd, SDMMC_STATIC_DATA_FLAGS);

        hsd->State = HAL_SD_STATE_READY;

        return HAL_OK;
    }
    else
    {
        hsd->ErrorCode |= HAL_SD_ERROR_BUSY;
        return HAL_ERROR;
    }
}

/**
 * @brief  Reads block(s) from a specified address in a card. The Data transfer
 *         is managed in interrupt mode.
 * @note   This API should be followed by a check on the card state through
 *         HAL_SD_GetCardState().
 * @note   You could also check the IT transfer process through the SD Rx
 *         interrupt event.
 * @param  hsd Pointer to SD handle
 * @param  pData Pointer to the buffer that will contain the received data
 * @param  BlockAdd Block Address from where data is to be read
 * @param  NumberOfBlocks Number of blocks to read.
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_SD_ReadBlocks_IT(SD_HandleTypeDef* hsd,
                                       uint8_t*          pData,
                                       uint32_t          BlockAdd,
                                       uint32_t          NumberOfBlocks)
{
    SDMMC_DataInitTypeDef config;
    uint32_t              errorstate;
    uint32_t              add = BlockAdd;

    if (NULL == pData)
    {
        hsd->ErrorCode |= HAL_SD_ERROR_PARAM;
        return HAL_ERROR;
    }

    if (hsd->State == HAL_SD_STATE_READY)
    {
        hsd->ErrorCode = HAL_SD_ERROR_NONE;

        if ((add + NumberOfBlocks) > (hsd->SdCard.LogBlockNbr))
        {
            hsd->ErrorCode |= HAL_SD_ERROR_ADDR_OUT_OF_RANGE;
            return HAL_ERROR;
        }

        hsd->State = HAL_SD_STATE_BUSY;

        /* Initialize data control register */
        hsd->Instance->DCTRL = 0U;

        hsd->pRxBuffPtr = pData;
        hsd->RxXferSize = BLOCKSIZE * NumberOfBlocks;

        if (hsd->SdCard.CardType != CARD_SDHC_SDXC)
        {
            add *= 512U;
        }

        /* Configure the SD DPSM (Data Path State Machine) */
        config.DataTimeOut   = SDMMC_DATATIMEOUT;
        config.DataLength    = BLOCKSIZE * NumberOfBlocks;
        config.DataBlockSize = SDMMC_DATABLOCK_SIZE_512B;
        config.TransferDir   = SDMMC_TRANSFER_DIR_TO_SDMMC;
        config.TransferMode  = SDMMC_TRANSFER_MODE_BLOCK;
#if defined(STM32L4P5xx) || defined(STM32L4Q5xx) || defined(STM32L4R5xx) ||                        \
  defined(STM32L4R7xx) || defined(STM32L4R9xx) || defined(STM32L4S5xx) || defined(STM32L4S7xx) ||  \
  defined(STM32L4S9xx)
        config.DPSM = SDMMC_DPSM_DISABLE;
#else
        config.DPSM     = SDMMC_DPSM_ENABLE;
#endif /* STM32L4P5xx || STM32L4Q5xx || STM32L4R5xx || STM32L4R7xx || STM32L4R9xx || STM32L4S5xx   \
          || STM32L4S7xx || STM32L4S9xx */
        (void)SDMMC_ConfigData(hsd->Instance, &config);
#if defined(STM32L4P5xx) || defined(STM32L4Q5xx) || defined(STM32L4R5xx) ||                        \
  defined(STM32L4R7xx) || defined(STM32L4R9xx) || defined(STM32L4S5xx) || defined(STM32L4S7xx) ||  \
  defined(STM32L4S9xx)
        __SDMMC_CMDTRANS_ENABLE(hsd->Instance);
#endif /* STM32L4P5xx || STM32L4Q5xx || STM32L4R5xx || STM32L4R7xx || STM32L4R9xx || STM32L4S5xx   \
          || STM32L4S7xx || STM32L4S9xx */

        /* Read Blocks in IT mode */
        if (NumberOfBlocks > 1U)
        {
            hsd->Context = (SD_CONTEXT_READ_MULTIPLE_BLOCK | SD_CONTEXT_IT);

            /* Read Multi Block command */
            errorstate = SDMMC_CmdReadMultiBlock(hsd->Instance, add);
        }
        else
        {
            hsd->Context = (SD_CONTEXT_READ_SINGLE_BLOCK | SD_CONTEXT_IT);

            /* Read Single Block command */
            errorstate = SDMMC_CmdReadSingleBlock(hsd->Instance, add);
        }
        if (errorstate != HAL_SD_ERROR_NONE)
        {
            /* Clear all the static flags */
            __HAL_SD_CLEAR_FLAG(hsd, SDMMC_STATIC_FLAGS);
            hsd->ErrorCode |= errorstate;
            hsd->State   = HAL_SD_STATE_READY;
            hsd->Context = SD_CONTEXT_NONE;
            return HAL_ERROR;
        }

