smartel99/NilaiTFO/bsp/stm32l4xx_hal_sd.cpp
        __HAL_SD_ENABLE_IT(hsd,
                           (SDMMC_IT_DCRCFAIL | SDMMC_IT_DTIMEOUT | SDMMC_IT_RXOVERR |
                            SDMMC_IT_DATAEND | SDMMC_FLAG_RXFIFOHF));

        return HAL_OK;
    }
    else
    {
        return HAL_BUSY;
    }
}

/**
 * @brief  Writes block(s) to a specified address in a card. The Data transfer
 *         is managed in interrupt mode.
 * @note   This API should be followed by a check on the card state through
 *         HAL_SD_GetCardState().
 * @note   You could also check the IT transfer process through the SD Tx
 *         interrupt event.
 * @param  hsd Pointer to SD handle
 * @param  pData Pointer to the buffer that will contain the data to transmit
 * @param  BlockAdd Block Address where data will be written
 * @param  NumberOfBlocks Number of blocks to write
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_SD_WriteBlocks_IT(SD_HandleTypeDef* hsd,
                                        uint8_t*          pData,
                                        uint32_t          BlockAdd,
                                        uint32_t          NumberOfBlocks)
{
    SDMMC_DataInitTypeDef config;
    uint32_t              errorstate;
    uint32_t              add = BlockAdd;

    if (NULL == pData)
    {
        hsd->ErrorCode |= HAL_SD_ERROR_PARAM;
        return HAL_ERROR;
    }

    if (hsd->State == HAL_SD_STATE_READY)
    {
        hsd->ErrorCode = HAL_SD_ERROR_NONE;

        if ((add + NumberOfBlocks) > (hsd->SdCard.LogBlockNbr))
        {
            hsd->ErrorCode |= HAL_SD_ERROR_ADDR_OUT_OF_RANGE;
            return HAL_ERROR;
        }

        hsd->State = HAL_SD_STATE_BUSY;

        /* Initialize data control register */
        hsd->Instance->DCTRL = 0U;

        hsd->pTxBuffPtr = pData;
        hsd->TxXferSize = BLOCKSIZE * NumberOfBlocks;

        if (hsd->SdCard.CardType != CARD_SDHC_SDXC)
        {
            add *= 512U;
        }

#if defined(STM32L4P5xx) || defined(STM32L4Q5xx) || defined(STM32L4R5xx) ||                        \
  defined(STM32L4R7xx) || defined(STM32L4R9xx) || defined(STM32L4S5xx) || defined(STM32L4S7xx) ||  \
  defined(STM32L4S9xx)
        /* Configure the SD DPSM (Data Path State Machine) */
        config.DataTimeOut   = SDMMC_DATATIMEOUT;
        config.DataLength    = BLOCKSIZE * NumberOfBlocks;
        config.DataBlockSize = SDMMC_DATABLOCK_SIZE_512B;
        config.TransferDir   = SDMMC_TRANSFER_DIR_TO_CARD;
        config.TransferMode  = SDMMC_TRANSFER_MODE_BLOCK;
        config.DPSM          = SDMMC_DPSM_DISABLE;
        (void)SDMMC_ConfigData(hsd->Instance, &config);

        __SDMMC_CMDTRANS_ENABLE(hsd->Instance);
#endif /* STM32L4P5xx || STM32L4Q5xx || STM32L4R5xx || STM32L4R7xx || STM32L4R9xx || STM32L4S5xx   \
          || STM32L4S7xx || STM32L4S9xx */

        /* Write Blocks in Polling mode */
        if (NumberOfBlocks > 1U)
        {
            hsd->Context = (SD_CONTEXT_WRITE_MULTIPLE_BLOCK | SD_CONTEXT_IT);

            /* Write Multi Block command */
            errorstate = SDMMC_CmdWriteMultiBlock(hsd->Instance, add);
        }
        else
        {
            hsd->Context = (SD_CONTEXT_WRITE_SINGLE_BLOCK | SD_CONTEXT_IT);

            /* Write Single Block command */
            errorstate = SDMMC_CmdWriteSingleBlock(hsd->Instance, add);
        }
        if (errorstate != HAL_SD_ERROR_NONE)
        {
            /* Clear all the static flags */
            __HAL_SD_CLEAR_FLAG(hsd, SDMMC_STATIC_FLAGS);
            hsd->ErrorCode |= errorstate;
            hsd->State   = HAL_SD_STATE_READY;
            hsd->Context = SD_CONTEXT_NONE;
            return HAL_ERROR;
        }

#if !defined(STM32L4P5xx) && !defined(STM32L4Q5xx) && !defined(STM32L4R5xx) &&                     \
  !defined(STM32L4R7xx) && !defined(STM32L4R9xx) && !defined(STM32L4S5xx) &&                       \
  !defined(STM32L4S7xx) && !defined(STM32L4S9xx)
        /* Configure the SD DPSM (Data Path State Machine) */
        config.DataTimeOut   = SDMMC_DATATIMEOUT;
        config.DataLength    = BLOCKSIZE * NumberOfBlocks;
        config.DataBlockSize = SDMMC_DATABLOCK_SIZE_512B;
        config.TransferDir   = SDMMC_TRANSFER_DIR_TO_CARD;
        config.TransferMode  = SDMMC_TRANSFER_MODE_BLOCK;
        config.DPSM          = SDMMC_DPSM_ENABLE;
        (void)SDMMC_ConfigData(hsd->Instance, &config);
#endif /* !STM32L4P5xx && !STM32L4Q5xx && !STM32L4R5xx && !STM32L4R7xx && !STM32L4R9xx &&          \
          !STM32L4S5xx && !STM32L4S7xx && !STM32L4S9xx */

        /* Enable transfer interrupts */
        __HAL_SD_ENABLE_IT(hsd,
                           (SDMMC_IT_DCRCFAIL | SDMMC_IT_DTIMEOUT | SDMMC_IT_TXUNDERR |
                            SDMMC_IT_DATAEND | SDMMC_FLAG_TXFIFOHE));

        return HAL_OK;
    }
    else
    {
        return HAL_BUSY;
    }
}

/**
 * @brief  Reads block(s) from a specified address in a card. The Data transfer
 *         is managed by DMA mode.
 * @note   This API should be followed by a check on the card state through
 *         HAL_SD_GetCardState().
 * @note   You could also check the DMA transfer process through the SD Rx
 *         interrupt event.
 * @param  hsd Pointer SD handle
 * @param  pData Pointer to the buffer that will contain the received data
 * @param  BlockAdd Block Address from where data is to be read
 * @param  NumberOfBlocks Number of blocks to read.
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_SD_ReadBlocks_DMA(SD_HandleTypeDef* hsd,
                                        uint8_t*          pData,
                                        uint32_t          BlockAdd,
                                        uint32_t          NumberOfBlocks)
{
    SDMMC_DataInitTypeDef config;
    uint32_t              errorstate;
    uint32_t              add = BlockAdd;

    if (NULL == pData)
    {
        hsd->ErrorCode |= HAL_SD_ERROR_PARAM;
        return HAL_ERROR;
    }

    if (hsd->State == HAL_SD_STATE_READY)
    {
        hsd->ErrorCode = HAL_SD_ERROR_NONE;

        if ((add + NumberOfBlocks) > (hsd->SdCard.LogBlockNbr))
        {
            hsd->ErrorCode |= HAL_SD_ERROR_ADDR_OUT_OF_RANGE;
            return HAL_ERROR;
        }

        hsd->State = HAL_SD_STATE_BUSY;

        /* Initialize data control register */
        hsd->Instance->DCTRL = 0U;

#if !defined(STM32L4P5xx) && !defined(STM32L4Q5xx) && !defined(STM32L4R5xx) &&                     \
  !defined(STM32L4R7xx) && !defined(STM32L4R9xx) && !defined(STM32L4S5xx) &&                       \
  !defined(STM32L4S7xx) && !defined(STM32L4S9xx)
        /* Set the DMA transfer complete callback */
        hsd->hdmarx->XferCpltCallback = SD_DMAReceiveCplt;

        /* Set the DMA error callback */
        hsd->hdmarx->XferErrorCallback = SD_DMAError;

        /* Set the DMA Abort callback */
        hsd->hdmarx->XferAbortCallback = NULL;

        /* Enable the DMA Channel */
        if (HAL_DMA_Start_IT(hsd->hdmarx,
                             (uint32_t)&hsd->Instance->FIFO,
                             (uint32_t)pData,
                             (uint32_t)(BLOCKSIZE * NumberOfBlocks) / 4U) != HAL_OK)
        {
            __HAL_SD_CLEAR_FLAG(hsd, SDMMC_STATIC_FLAGS);
            hsd->ErrorCode |= HAL_SD_ERROR_DMA;
            hsd->State = HAL_SD_STATE_READY;
            return HAL_ERROR;
        }
        else
        {
            /* Enable SD DMA transfer */
            __HAL_SD_DMA_ENABLE(hsd);
#else
        hsd->pRxBuffPtr = pData;
        hsd->RxXferSize = BLOCKSIZE * NumberOfBlocks;
#endif /* !STM32L4P5xx && !STM32L4Q5xx && !STM32L4R5xx && !STM32L4R7xx && !STM32L4R9xx &&          \
          !STM32L4S5xx && !STM32L4S7xx && !STM32L4S9xx */

            if (hsd->SdCard.CardType != CARD_SDHC_SDXC)
            {
                add *= 512U;
            }

            /* Configure the SD DPSM (Data Path State Machine) */
            config.DataTimeOut   = SDMMC_DATATIMEOUT;
            config.DataLength    = BLOCKSIZE * NumberOfBlocks;
            config.DataBlockSize = SDMMC_DATABLOCK_SIZE_512B;
            config.TransferDir   = SDMMC_TRANSFER_DIR_TO_SDMMC;
            config.TransferMode  = SDMMC_TRANSFER_MODE_BLOCK;
#if defined(STM32L4P5xx) || defined(STM32L4Q5xx) || defined(STM32L4R5xx) ||                        \
  defined(STM32L4R7xx) || defined(STM32L4R9xx) || defined(STM32L4S5xx) || defined(STM32L4S7xx) ||  \
  defined(STM32L4S9xx)
            config.DPSM = SDMMC_DPSM_DISABLE;
#else
        config.DPSM     = SDMMC_DPSM_ENABLE;
#endif /* STM32L4P5xx || STM32L4Q5xx || STM32L4R5xx || STM32L4R7xx || STM32L4R9xx || STM32L4S5xx   \
          || STM32L4S7xx || STM32L4S9xx */
            (void)SDMMC_ConfigData(hsd->Instance, &config);

#if defined(STM32L4P5xx) || defined(STM32L4Q5xx) || defined(STM32L4R5xx) ||                        \
  defined(STM32L4R7xx) || defined(STM32L4R9xx) || defined(STM32L4S5xx) || defined(STM32L4S7xx) ||  \
  defined(STM32L4S9xx)

            __SDMMC_CMDTRANS_ENABLE(hsd->Instance);
            hsd->Instance->IDMABASE0 = (uint32_t)pData;
            hsd->Instance->IDMACTRL  = SDMMC_ENABLE_IDMA_SINGLE_BUFF;
#endif /* STM32L4P5xx || STM32L4Q5xx || STM32L4R5xx || STM32L4R7xx || STM32L4R9xx || STM32L4S5xx   \
          || STM32L4S7xx || STM32L4S9xx */

            /* Read Blocks in DMA mode */
            if (NumberOfBlocks > 1U)
            {
                hsd->Context = (SD_CONTEXT_READ_MULTIPLE_BLOCK | SD_CONTEXT_DMA);

                /* Read Multi Block command */
                errorstate = SDMMC_CmdReadMultiBlock(hsd->Instance, add);
            }
            else
            {
                hsd->Context = (SD_CONTEXT_READ_SINGLE_BLOCK | SD_CONTEXT_DMA);

                /* Read Single Block command */
                errorstate = SDMMC_CmdReadSingleBlock(hsd->Instance, add);
            }
            if (errorstate != HAL_SD_ERROR_NONE)
            {
                /* Clear all the static flags */
                __HAL_SD_CLEAR_FLAG(hsd, SDMMC_STATIC_FLAGS);
                hsd->ErrorCode |= errorstate;
                hsd->State   = HAL_SD_STATE_READY;
                hsd->Context = SD_CONTEXT_NONE;
                return HAL_ERROR;
            }

            /* Enable transfer interrupts */
            __HAL_SD_ENABLE_IT(hsd,
                               (SDMMC_IT_DCRCFAIL | SDMMC_IT_DTIMEOUT | SDMMC_IT_RXOVERR |
                                SDMMC_IT_DATAEND));

            return HAL_OK;
#if !defined(STM32L4P5xx) && !defined(STM32L4Q5xx) && !defined(STM32L4R5xx) &&                     \
  !defined(STM32L4R7xx) && !defined(STM32L4R9xx) && !defined(STM32L4S5xx) &&                       \
  !defined(STM32L4S7xx) && !defined(STM32L4S9xx)
        }
#endif
    }
    else
    {
        return HAL_BUSY;
    }
}

/**
 * @brief  Writes block(s) to a specified address in a card. The Data transfer
 *         is managed by DMA mode.
 * @note   This API should be followed by a check on the card state through
 *         HAL_SD_GetCardState().
 * @note   You could also check the DMA transfer process through the SD Tx
 *         interrupt event.
 * @param  hsd Pointer to SD handle
 * @param  pData Pointer to the buffer that will contain the data to transmit
 * @param  BlockAdd Block Address where data will be written
 * @param  NumberOfBlocks Number of blocks to write
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_SD_WriteBlocks_DMA(SD_HandleTypeDef* hsd,
                                         uint8_t*          pData,
                                         uint32_t          BlockAdd,
                                         uint32_t          NumberOfBlocks)
{
    SDMMC_DataInitTypeDef config;
    uint32_t              errorstate;
    uint32_t              add = BlockAdd;

    if (NULL == pData)
    {
        hsd->ErrorCode |= HAL_SD_ERROR_PARAM;
        return HAL_ERROR;
    }

    if (hsd->State == HAL_SD_STATE_READY)
    {
        hsd->ErrorCode = HAL_SD_ERROR_NONE;

        if ((add + NumberOfBlocks) > (hsd->SdCard.LogBlockNbr))
        {
            hsd->ErrorCode |= HAL_SD_ERROR_ADDR_OUT_OF_RANGE;
            return HAL_ERROR;
        }

        hsd->State = HAL_SD_STATE_BUSY;

        /* Initialize data control register */
        hsd->Instance->DCTRL = 0U;

#if defined(STM32L4P5xx) || defined(STM32L4Q5xx) || defined(STM32L4R5xx) ||                        \
  defined(STM32L4R7xx) || defined(STM32L4R9xx) || defined(STM32L4S5xx) || defined(STM32L4S7xx) ||  \
  defined(STM32L4S9xx)
        hsd->pTxBuffPtr = pData;
        hsd->TxXferSize = BLOCKSIZE * NumberOfBlocks;
#else
        /* Set the DMA transfer complete callback */
        hsd->hdmatx->XferCpltCallback = SD_DMATransmitCplt;

        /* Set the DMA error callback */
        hsd->hdmatx->XferErrorCallback = SD_DMAError;

        /* Set the DMA Abort callback */
        hsd->hdmatx->XferAbortCallback = NULL;
#endif /* STM32L4P5xx || STM32L4Q5xx || STM32L4R5xx || STM32L4R7xx || STM32L4R9xx || STM32L4S5xx   \
          || STM32L4S7xx || STM32L4S9xx */

        if (hsd->SdCard.CardType != CARD_SDHC_SDXC)
        {
            add *= 512U;
        }

#if defined(STM32L4P5xx) || defined(STM32L4Q5xx) || defined(STM32L4R5xx) ||                        \
  defined(STM32L4R7xx) || defined(STM32L4R9xx) || defined(STM32L4S5xx) || defined(STM32L4S7xx) ||  \
  defined(STM32L4S9xx)
        /* Configure the SD DPSM (Data Path State Machine) */
        config.DataTimeOut   = SDMMC_DATATIMEOUT;
        config.DataLength    = BLOCKSIZE * NumberOfBlocks;
        config.DataBlockSize = SDMMC_DATABLOCK_SIZE_512B;
        config.TransferDir   = SDMMC_TRANSFER_DIR_TO_CARD;
        config.TransferMode  = SDMMC_TRANSFER_MODE_BLOCK;
        config.DPSM          = SDMMC_DPSM_DISABLE;
        (void)SDMMC_ConfigData(hsd->Instance, &config);

        __SDMMC_CMDTRANS_ENABLE(hsd->Instance);

