smartel99/NilaiTFO/bsp/stm32l4xx_hal_sd.cpp
        hsd->Instance->IDMABASE0 = (uint32_t)pData;
        hsd->Instance->IDMACTRL  = SDMMC_ENABLE_IDMA_SINGLE_BUFF;
#endif /* STM32L4P5xx || STM32L4Q5xx || STM32L4R5xx || STM32L4R7xx || STM32L4R9xx || STM32L4S5xx   \
          || STM32L4S7xx || STM32L4S9xx */

        /* Write Blocks in Polling mode */
        if (NumberOfBlocks > 1U)
        {
            hsd->Context = (SD_CONTEXT_WRITE_MULTIPLE_BLOCK | SD_CONTEXT_DMA);

            /* Write Multi Block command */
            errorstate = SDMMC_CmdWriteMultiBlock(hsd->Instance, add);
        }
        else
        {
            hsd->Context = (SD_CONTEXT_WRITE_SINGLE_BLOCK | SD_CONTEXT_DMA);

            /* Write Single Block command */
            errorstate = SDMMC_CmdWriteSingleBlock(hsd->Instance, add);
        }
        if (errorstate != HAL_SD_ERROR_NONE)
        {
            /* Clear all the static flags */
            __HAL_SD_CLEAR_FLAG(hsd, SDMMC_STATIC_FLAGS);
            hsd->ErrorCode |= errorstate;
            hsd->State   = HAL_SD_STATE_READY;
            hsd->Context = SD_CONTEXT_NONE;
            return HAL_ERROR;
        }

#if !defined(STM32L4P5xx) && !defined(STM32L4Q5xx) && !defined(STM32L4R5xx) &&                     \
  !defined(STM32L4R7xx) && !defined(STM32L4R9xx) && !defined(STM32L4S5xx) &&                       \
  !defined(STM32L4S7xx) && !defined(STM32L4S9xx)
        /* Enable SDMMC DMA transfer */
        __HAL_SD_DMA_ENABLE(hsd);

        /* Enable the DMA Channel */
        if (HAL_DMA_Start_IT(hsd->hdmatx,
                             (uint32_t)pData,
                             (uint32_t)&hsd->Instance->FIFO,
                             (uint32_t)(BLOCKSIZE * NumberOfBlocks) / 4U) != HAL_OK)
        {
            __HAL_SD_CLEAR_FLAG(hsd, SDMMC_STATIC_FLAGS);
            hsd->ErrorCode |= HAL_SD_ERROR_DMA;
            hsd->State   = HAL_SD_STATE_READY;
            hsd->Context = SD_CONTEXT_NONE;
            return HAL_ERROR;
        }
        else
        {
            /* Configure the SD DPSM (Data Path State Machine) */
            config.DataTimeOut   = SDMMC_DATATIMEOUT;
            config.DataLength    = BLOCKSIZE * NumberOfBlocks;
            config.DataBlockSize = SDMMC_DATABLOCK_SIZE_512B;
            config.TransferDir   = SDMMC_TRANSFER_DIR_TO_CARD;
            config.TransferMode  = SDMMC_TRANSFER_MODE_BLOCK;
            config.DPSM          = SDMMC_DPSM_ENABLE;
            (void)SDMMC_ConfigData(hsd->Instance, &config);

            /* Enable SD Error interrupts */
            __HAL_SD_ENABLE_IT(hsd, (SDMMC_IT_DCRCFAIL | SDMMC_IT_DTIMEOUT | SDMMC_IT_TXUNDERR));
#else
        /* Enable transfer interrupts */
        __HAL_SD_ENABLE_IT(hsd,
                           (SDMMC_IT_DCRCFAIL | SDMMC_IT_DTIMEOUT | SDMMC_IT_TXUNDERR |
                            SDMMC_IT_DATAEND));
#endif /* !STM32L4P5xx && !STM32L4Q5xx && !STM32L4R5xx && !STM32L4R7xx && !STM32L4R9xx &&          \
          !STM32L4S5xx && !STM32L4S7xx && !STM32L4S9xx */

            return HAL_OK;
#if !defined(STM32L4P5xx) && !defined(STM32L4Q5xx) && !defined(STM32L4R5xx) &&                     \
  !defined(STM32L4R7xx) && !defined(STM32L4R9xx) && !defined(STM32L4S5xx) &&                       \
  !defined(STM32L4S7xx) && !defined(STM32L4S9xx)
        }
#endif
    }
    else
    {
        return HAL_BUSY;
    }
}

/**
 * @brief  Erases the specified memory area of the given SD card.
 * @note   This API should be followed by a check on the card state through
 *         HAL_SD_GetCardState().
 * @param  hsd Pointer to SD handle
 * @param  BlockStartAdd Start Block address
 * @param  BlockEndAdd End Block address
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_SD_Erase(SD_HandleTypeDef* hsd, uint32_t BlockStartAdd, uint32_t BlockEndAdd)
{
    uint32_t errorstate;
    uint32_t start_add = BlockStartAdd;
    uint32_t end_add   = BlockEndAdd;

    if (hsd->State == HAL_SD_STATE_READY)
    {
        hsd->ErrorCode = HAL_SD_ERROR_NONE;

        if (end_add < start_add)
        {
            hsd->ErrorCode |= HAL_SD_ERROR_PARAM;
            return HAL_ERROR;
        }

        if (end_add > (hsd->SdCard.LogBlockNbr))
        {
            hsd->ErrorCode |= HAL_SD_ERROR_ADDR_OUT_OF_RANGE;
            return HAL_ERROR;
        }

        hsd->State = HAL_SD_STATE_BUSY;

        /* Check if the card command class supports erase command */
        if (((hsd->SdCard.Class) & SDMMC_CCCC_ERASE) == 0U)
        {
            /* Clear all the static flags */
            __HAL_SD_CLEAR_FLAG(hsd, SDMMC_STATIC_FLAGS);
            hsd->ErrorCode |= HAL_SD_ERROR_REQUEST_NOT_APPLICABLE;
            hsd->State = HAL_SD_STATE_READY;
            return HAL_ERROR;
        }

        if ((SDMMC_GetResponse(hsd->Instance, SDMMC_RESP1) & SDMMC_CARD_LOCKED) ==
            SDMMC_CARD_LOCKED)
        {
            /* Clear all the static flags */
            __HAL_SD_CLEAR_FLAG(hsd, SDMMC_STATIC_FLAGS);
            hsd->ErrorCode |= HAL_SD_ERROR_LOCK_UNLOCK_FAILED;
            hsd->State = HAL_SD_STATE_READY;
            return HAL_ERROR;
        }

        /* Get start and end block for high capacity cards */
        if (hsd->SdCard.CardType != CARD_SDHC_SDXC)
        {
            start_add *= 512U;
            end_add *= 512U;
        }

        /* According to sd-card spec 1.0 ERASE_GROUP_START (CMD32) and erase_group_end(CMD33) */
        if (hsd->SdCard.CardType != CARD_SECURED)
        {
            /* Send CMD32 SD_ERASE_GRP_START with argument as addr  */
            errorstate = SDMMC_CmdSDEraseStartAdd(hsd->Instance, start_add);
            if (errorstate != HAL_SD_ERROR_NONE)
            {
                /* Clear all the static flags */
                __HAL_SD_CLEAR_FLAG(hsd, SDMMC_STATIC_FLAGS);
                hsd->ErrorCode |= errorstate;
                hsd->State = HAL_SD_STATE_READY;
                return HAL_ERROR;
            }

            /* Send CMD33 SD_ERASE_GRP_END with argument as addr  */
            errorstate = SDMMC_CmdSDEraseEndAdd(hsd->Instance, end_add);
            if (errorstate != HAL_SD_ERROR_NONE)
            {
                /* Clear all the static flags */
                __HAL_SD_CLEAR_FLAG(hsd, SDMMC_STATIC_FLAGS);
                hsd->ErrorCode |= errorstate;
                hsd->State = HAL_SD_STATE_READY;
                return HAL_ERROR;
            }
        }

