smartel99/NilaiTFO/bsp/stm32l4xx_hal_sd.cpp
        /* Send CMD38 ERASE */
        errorstate = SDMMC_CmdErase(hsd->Instance, 0UL);
        if (errorstate != HAL_SD_ERROR_NONE)
        {
            /* Clear all the static flags */
            __HAL_SD_CLEAR_FLAG(hsd, SDMMC_STATIC_FLAGS);
            hsd->ErrorCode |= errorstate;
            hsd->State = HAL_SD_STATE_READY;
            return HAL_ERROR;
        }

        hsd->State = HAL_SD_STATE_READY;

        return HAL_OK;
    }
    else
    {
        return HAL_BUSY;
    }
}

/**
 * @brief  This function handles SD card interrupt request.
 * @param  hsd Pointer to SD handle
 * @retval None
 */
void HAL_SD_IRQHandler(SD_HandleTypeDef* hsd)
{
    uint32_t errorstate;
    uint32_t context = hsd->Context;

    /* Check for SDMMC interrupt flags */
    if ((__HAL_SD_GET_FLAG(hsd, SDMMC_FLAG_RXFIFOHF) != RESET) && ((context & SD_CONTEXT_IT) != 0U))
    {
        SD_Read_IT(hsd);
    }

    else if (__HAL_SD_GET_FLAG(hsd, SDMMC_FLAG_DATAEND) != RESET)
    {
        __HAL_SD_CLEAR_FLAG(hsd, SDMMC_FLAG_DATAEND);

        __HAL_SD_DISABLE_IT(hsd,
                            SDMMC_IT_DATAEND | SDMMC_IT_DCRCFAIL | SDMMC_IT_DTIMEOUT |
                              SDMMC_IT_TXUNDERR | SDMMC_IT_RXOVERR | SDMMC_IT_TXFIFOHE |
                              SDMMC_IT_RXFIFOHF);

#if defined(STM32L4P5xx) || defined(STM32L4Q5xx) || defined(STM32L4R5xx) ||                        \
  defined(STM32L4R7xx) || defined(STM32L4R9xx) || defined(STM32L4S5xx) || defined(STM32L4S7xx) ||  \
  defined(STM32L4S9xx)
        __HAL_SD_DISABLE_IT(hsd, SDMMC_IT_IDMABTC);
        __SDMMC_CMDTRANS_DISABLE(hsd->Instance);
#else
        hsd->Instance->DCTRL &= ~(SDMMC_DCTRL_DTEN);
#endif /* STM32L4P5xx || STM32L4Q5xx || STM32L4R5xx || STM32L4R7xx || STM32L4R9xx || STM32L4S5xx   \
          || STM32L4S7xx || STM32L4S9xx */

        if ((context & SD_CONTEXT_IT) != 0U)
        {
            if (((context & SD_CONTEXT_READ_MULTIPLE_BLOCK) != 0U) ||
                ((context & SD_CONTEXT_WRITE_MULTIPLE_BLOCK) != 0U))
            {
                errorstate = SDMMC_CmdStopTransfer(hsd->Instance);
                if (errorstate != HAL_SD_ERROR_NONE)
                {
                    hsd->ErrorCode |= errorstate;
#if defined(USE_HAL_SD_REGISTER_CALLBACKS) && (USE_HAL_SD_REGISTER_CALLBACKS == 1U)
                    hsd->ErrorCallback(hsd);
#else
                    HAL_SD_ErrorCallback(hsd);
#endif /* USE_HAL_SD_REGISTER_CALLBACKS */
                }
            }

            /* Clear all the static flags */
            __HAL_SD_CLEAR_FLAG(hsd, SDMMC_STATIC_DATA_FLAGS);

            hsd->State   = HAL_SD_STATE_READY;
            hsd->Context = SD_CONTEXT_NONE;
            if (((context & SD_CONTEXT_READ_SINGLE_BLOCK) != 0U) ||
                ((context & SD_CONTEXT_READ_MULTIPLE_BLOCK) != 0U))
            {
#if defined(USE_HAL_SD_REGISTER_CALLBACKS) && (USE_HAL_SD_REGISTER_CALLBACKS == 1U)
                hsd->RxCpltCallback(hsd);
#else
                HAL_SD_RxCpltCallback(hsd);
#endif /* USE_HAL_SD_REGISTER_CALLBACKS */
            }
            else
            {
#if defined(USE_HAL_SD_REGISTER_CALLBACKS) && (USE_HAL_SD_REGISTER_CALLBACKS == 1U)
                hsd->TxCpltCallback(hsd);
#else
                HAL_SD_TxCpltCallback(hsd);
#endif /* USE_HAL_SD_REGISTER_CALLBACKS */
            }
        }
        else if ((context & SD_CONTEXT_DMA) != 0U)
        {
#if defined(STM32L4P5xx) || defined(STM32L4Q5xx) || defined(STM32L4R5xx) ||                        \
  defined(STM32L4R7xx) || defined(STM32L4R9xx) || defined(STM32L4S5xx) || defined(STM32L4S7xx) ||  \
  defined(STM32L4S9xx)
            hsd->Instance->DLEN     = 0;
            hsd->Instance->DCTRL    = 0;
            hsd->Instance->IDMACTRL = SDMMC_DISABLE_IDMA;

            /* Stop Transfer for Write Multi blocks or Read Multi blocks */
            if (((context & SD_CONTEXT_READ_MULTIPLE_BLOCK) != 0U) ||
                ((context & SD_CONTEXT_WRITE_MULTIPLE_BLOCK) != 0U))
            {
                errorstate = SDMMC_CmdStopTransfer(hsd->Instance);
                if (errorstate != HAL_SD_ERROR_NONE)
                {
                    hsd->ErrorCode |= errorstate;
#if defined(USE_HAL_SD_REGISTER_CALLBACKS) && (USE_HAL_SD_REGISTER_CALLBACKS == 1U)
                    hsd->ErrorCallback(hsd);
#else
                    HAL_SD_ErrorCallback(hsd);
#endif /* USE_HAL_SD_REGISTER_CALLBACKS */
                }
            }

            hsd->State   = HAL_SD_STATE_READY;
            hsd->Context = SD_CONTEXT_NONE;
            if (((context & SD_CONTEXT_WRITE_SINGLE_BLOCK) != 0U) ||
                ((context & SD_CONTEXT_WRITE_MULTIPLE_BLOCK) != 0U))
            {
#if defined(USE_HAL_SD_REGISTER_CALLBACKS) && (USE_HAL_SD_REGISTER_CALLBACKS == 1U)
                hsd->TxCpltCallback(hsd);
#else
                HAL_SD_TxCpltCallback(hsd);
#endif /* USE_HAL_SD_REGISTER_CALLBACKS */
            }
            if (((context & SD_CONTEXT_READ_SINGLE_BLOCK) != 0U) ||
                ((context & SD_CONTEXT_READ_MULTIPLE_BLOCK) != 0U))
            {
#if defined(USE_HAL_SD_REGISTER_CALLBACKS) && (USE_HAL_SD_REGISTER_CALLBACKS == 1U)
                hsd->RxCpltCallback(hsd);
#else
                HAL_SD_RxCpltCallback(hsd);
#endif /* USE_HAL_SD_REGISTER_CALLBACKS */
            }
#else
            if ((context & SD_CONTEXT_WRITE_MULTIPLE_BLOCK) != 0U)
            {
                errorstate = SDMMC_CmdStopTransfer(hsd->Instance);
                if (errorstate != HAL_SD_ERROR_NONE)
                {
                    hsd->ErrorCode |= errorstate;
#if defined(USE_HAL_SD_REGISTER_CALLBACKS) && (USE_HAL_SD_REGISTER_CALLBACKS == 1U)
                    hsd->ErrorCallback(hsd);
#else
                    HAL_SD_ErrorCallback(hsd);
#endif /* USE_HAL_SD_REGISTER_CALLBACKS */
                }
            }
            if (((context & SD_CONTEXT_READ_SINGLE_BLOCK) == 0U) &&
                ((context & SD_CONTEXT_READ_MULTIPLE_BLOCK) == 0U))
            {
                /* Disable the DMA transfer for transmit request by setting the DMAEN bit
                in the SD DCTRL register */
                hsd->Instance->DCTRL &= (uint32_t) ~((uint32_t)SDMMC_DCTRL_DMAEN);

                hsd->State = HAL_SD_STATE_READY;

#if defined(USE_HAL_SD_REGISTER_CALLBACKS) && (USE_HAL_SD_REGISTER_CALLBACKS == 1U)
                hsd->TxCpltCallback(hsd);
#else
                HAL_SD_TxCpltCallback(hsd);
#endif /* USE_HAL_SD_REGISTER_CALLBACKS */
            }
#endif /* STM32L4P5xx || STM32L4Q5xx || STM32L4R5xx || STM32L4R7xx || STM32L4R9xx || STM32L4S5xx   \
          || STM32L4S7xx || STM32L4S9xx */
        }
        else
        {
            /* Nothing to do */
        }
    }

    else if ((__HAL_SD_GET_FLAG(hsd, SDMMC_FLAG_TXFIFOHE) != RESET) &&
             ((context & SD_CONTEXT_IT) != 0U))
    {
        SD_Write_IT(hsd);
    }

