smartel99/NilaiTFO/bsp/stm32l4xx_hal_sd.cpp
    else if (__HAL_SD_GET_FLAG(hsd,
                               SDMMC_FLAG_DCRCFAIL | SDMMC_FLAG_DTIMEOUT | SDMMC_FLAG_RXOVERR |
                                 SDMMC_FLAG_TXUNDERR) != RESET)
    {
        /* Set Error code */
        if (__HAL_SD_GET_FLAG(hsd, SDMMC_IT_DCRCFAIL) != RESET)
        {
            hsd->ErrorCode |= HAL_SD_ERROR_DATA_CRC_FAIL;
        }
        if (__HAL_SD_GET_FLAG(hsd, SDMMC_IT_DTIMEOUT) != RESET)
        {
            hsd->ErrorCode |= HAL_SD_ERROR_DATA_TIMEOUT;
        }
        if (__HAL_SD_GET_FLAG(hsd, SDMMC_IT_RXOVERR) != RESET)
        {
            hsd->ErrorCode |= HAL_SD_ERROR_RX_OVERRUN;
        }
        if (__HAL_SD_GET_FLAG(hsd, SDMMC_IT_TXUNDERR) != RESET)
        {
            hsd->ErrorCode |= HAL_SD_ERROR_TX_UNDERRUN;
        }

        /* Clear All flags */
        __HAL_SD_CLEAR_FLAG(hsd, SDMMC_STATIC_DATA_FLAGS);

        /* Disable all interrupts */
        __HAL_SD_DISABLE_IT(hsd,
                            SDMMC_IT_DATAEND | SDMMC_IT_DCRCFAIL | SDMMC_IT_DTIMEOUT |
                              SDMMC_IT_TXUNDERR | SDMMC_IT_RXOVERR);

#if defined(STM32L4P5xx) || defined(STM32L4Q5xx) || defined(STM32L4R5xx) ||                        \
  defined(STM32L4R7xx) || defined(STM32L4R9xx) || defined(STM32L4S5xx) || defined(STM32L4S7xx) ||  \
  defined(STM32L4S9xx)
        __SDMMC_CMDTRANS_DISABLE(hsd->Instance);
        hsd->Instance->DCTRL |= SDMMC_DCTRL_FIFORST;
        hsd->Instance->CMD |= SDMMC_CMD_CMDSTOP;
#endif /* STM32L4P5xx || STM32L4Q5xx || STM32L4R5xx || STM32L4R7xx || STM32L4R9xx || STM32L4S5xx   \
          || STM32L4S7xx || STM32L4S9xx */
        hsd->ErrorCode |= SDMMC_CmdStopTransfer(hsd->Instance);
#if defined(STM32L4P5xx) || defined(STM32L4Q5xx) || defined(STM32L4R5xx) ||                        \
  defined(STM32L4R7xx) || defined(STM32L4R9xx) || defined(STM32L4S5xx) || defined(STM32L4S7xx) ||  \
  defined(STM32L4S9xx)
        hsd->Instance->CMD &= ~(SDMMC_CMD_CMDSTOP);
        __HAL_SD_CLEAR_FLAG(hsd, SDMMC_FLAG_DABORT);
#endif /* STM32L4P5xx || STM32L4Q5xx || STM32L4R5xx || STM32L4R7xx || STM32L4R9xx || STM32L4S5xx   \
          || STM32L4S7xx || STM32L4S9xx */

        if ((context & SD_CONTEXT_IT) != 0U)
        {
            /* Set the SD state to ready to be able to start again the process */
            hsd->State   = HAL_SD_STATE_READY;
            hsd->Context = SD_CONTEXT_NONE;
#if defined(USE_HAL_SD_REGISTER_CALLBACKS) && (USE_HAL_SD_REGISTER_CALLBACKS == 1U)
            hsd->ErrorCallback(hsd);
#else
            HAL_SD_ErrorCallback(hsd);
#endif /* USE_HAL_SD_REGISTER_CALLBACKS */
        }
        else if ((context & SD_CONTEXT_DMA) != 0U)
        {
#if defined(STM32L4P5xx) || defined(STM32L4Q5xx) || defined(STM32L4R5xx) ||                        \
  defined(STM32L4R7xx) || defined(STM32L4R9xx) || defined(STM32L4S5xx) || defined(STM32L4S7xx) ||  \
  defined(STM32L4S9xx)
            if (hsd->ErrorCode != HAL_SD_ERROR_NONE)
            {
                /* Disable Internal DMA */
                __HAL_SD_DISABLE_IT(hsd, SDMMC_IT_IDMABTC);
                hsd->Instance->IDMACTRL = SDMMC_DISABLE_IDMA;

                /* Set the SD state to ready to be able to start again the process */
                hsd->State = HAL_SD_STATE_READY;
#if defined(USE_HAL_SD_REGISTER_CALLBACKS) && (USE_HAL_SD_REGISTER_CALLBACKS == 1U)
                hsd->ErrorCallback(hsd);
#else
                HAL_SD_ErrorCallback(hsd);
#endif /* USE_HAL_SD_REGISTER_CALLBACKS */
            }
#else
            /* Abort the SD DMA channel */
            if (((context & SD_CONTEXT_WRITE_SINGLE_BLOCK) != 0U) ||
                ((context & SD_CONTEXT_WRITE_MULTIPLE_BLOCK) != 0U))
            {
                /* Set the DMA Tx abort callback */
                hsd->hdmatx->XferAbortCallback = SD_DMATxAbort;
                /* Abort DMA in IT mode */
                if (HAL_DMA_Abort_IT(hsd->hdmatx) != HAL_OK)
                {
                    SD_DMATxAbort(hsd->hdmatx);
                }
            }
            else if (((context & SD_CONTEXT_READ_SINGLE_BLOCK) != 0U) ||
                     ((context & SD_CONTEXT_READ_MULTIPLE_BLOCK) != 0U))
            {
                /* Set the DMA Rx abort callback */
                hsd->hdmarx->XferAbortCallback = SD_DMARxAbort;
                /* Abort DMA in IT mode */
                if (HAL_DMA_Abort_IT(hsd->hdmarx) != HAL_OK)
                {
                    SD_DMARxAbort(hsd->hdmarx);
                }
            }
            else
            {
                hsd->ErrorCode = HAL_SD_ERROR_NONE;
                hsd->State     = HAL_SD_STATE_READY;
                hsd->Context   = SD_CONTEXT_NONE;
#if defined(USE_HAL_SD_REGISTER_CALLBACKS) && (USE_HAL_SD_REGISTER_CALLBACKS == 1U)
                hsd->AbortCpltCallback(hsd);
#else
                HAL_SD_AbortCallback(hsd);
#endif /* USE_HAL_SD_REGISTER_CALLBACKS */
            }
#endif /* STM32L4P5xx || STM32L4Q5xx || STM32L4R5xx || STM32L4R7xx || STM32L4R9xx || STM32L4S5xx   \
          || STM32L4S7xx || STM32L4S9xx */
        }
        else
        {
            /* Nothing to do */
        }
    }

#if defined(STM32L4P5xx) || defined(STM32L4Q5xx) || defined(STM32L4R5xx) ||                        \
  defined(STM32L4R7xx) || defined(STM32L4R9xx) || defined(STM32L4S5xx) || defined(STM32L4S7xx) ||  \
  defined(STM32L4S9xx)
    else if (__HAL_SD_GET_FLAG(hsd, SDMMC_FLAG_IDMABTC) != RESET)
    {
        __HAL_SD_CLEAR_FLAG(hsd, SDMMC_FLAG_IDMABTC);
        if (READ_BIT(hsd->Instance->IDMACTRL, SDMMC_IDMA_IDMABACT) == 0U)
        {
            /* Current buffer is buffer0, Transfer complete for buffer1 */
            if ((context & SD_CONTEXT_WRITE_MULTIPLE_BLOCK) != 0U)
            {
#if defined(USE_HAL_SD_REGISTER_CALLBACKS) && (USE_HAL_SD_REGISTER_CALLBACKS == 1U)
                hsd->Write_DMADblBuf1CpltCallback(hsd);
#else
                HAL_SDEx_Write_DMADoubleBuffer1CpltCallback(hsd);
#endif /* USE_HAL_SD_REGISTER_CALLBACKS */
            }
            else /* SD_CONTEXT_READ_MULTIPLE_BLOCK */
            {
#if defined(USE_HAL_SD_REGISTER_CALLBACKS) && (USE_HAL_SD_REGISTER_CALLBACKS == 1U)
                hsd->Read_DMADblBuf1CpltCallback(hsd);
#else
                HAL_SDEx_Read_DMADoubleBuffer1CpltCallback(hsd);
#endif /* USE_HAL_SD_REGISTER_CALLBACKS */
            }
        }
        else /* SD_DMA_BUFFER1 */
        {
            /* Current buffer is buffer1, Transfer complete for buffer0 */
            if ((context & SD_CONTEXT_WRITE_MULTIPLE_BLOCK) != 0U)
            {
#if defined(USE_HAL_SD_REGISTER_CALLBACKS) && (USE_HAL_SD_REGISTER_CALLBACKS == 1U)
                hsd->Write_DMADblBuf0CpltCallback(hsd);
#else
                HAL_SDEx_Write_DMADoubleBuffer0CpltCallback(hsd);
#endif /* USE_HAL_SD_REGISTER_CALLBACKS */
            }
            else /* SD_CONTEXT_READ_MULTIPLE_BLOCK */
            {
#if defined(USE_HAL_SD_REGISTER_CALLBACKS) && (USE_HAL_SD_REGISTER_CALLBACKS == 1U)
                hsd->Read_DMADblBuf0CpltCallback(hsd);
#else
                HAL_SDEx_Read_DMADoubleBuffer0CpltCallback(hsd);
#endif /* USE_HAL_SD_REGISTER_CALLBACKS */
            }
        }
    }
#endif /* STM32L4P5xx || STM32L4Q5xx || STM32L4R5xx || STM32L4R7xx || STM32L4R9xx || STM32L4S5xx   \
          || STM32L4S7xx || STM32L4S9xx */
    else
    {
        /* Nothing to do */
    }
}

/**
 * @brief return the SD state
 * @param hsd Pointer to sd handle
 * @retval HAL state
 */
HAL_SD_StateTypeDef HAL_SD_GetState(SD_HandleTypeDef* hsd)
{
    return hsd->State;
}

/**
 * @brief  Return the SD error code
 * @param  hsd : Pointer to a SD_HandleTypeDef structure that contains
 *              the configuration information.
 * @retval SD Error Code
 */
uint32_t HAL_SD_GetError(SD_HandleTypeDef* hsd)
{
    return hsd->ErrorCode;
}

/**
 * @brief Tx Transfer completed callbacks
 * @param hsd Pointer to SD handle
 * @retval None
 */
__weak void HAL_SD_TxCpltCallback(SD_HandleTypeDef* hsd)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hsd);

    /* NOTE : This function should not be modified, when the callback is needed,
              the HAL_SD_TxCpltCallback can be implemented in the user file
     */
}

/**
 * @brief Rx Transfer completed callbacks
 * @param hsd Pointer SD handle
 * @retval None
 */
__weak void HAL_SD_RxCpltCallback(SD_HandleTypeDef* hsd)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hsd);

    /* NOTE : This function should not be modified, when the callback is needed,
              the HAL_SD_RxCpltCallback can be implemented in the user file
     */
}

/**
 * @brief SD error callbacks
 * @param hsd Pointer SD handle
 * @retval None
 */
__weak void HAL_SD_ErrorCallback(SD_HandleTypeDef* hsd)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hsd);

    /* NOTE : This function should not be modified, when the callback is needed,
              the HAL_SD_ErrorCallback can be implemented in the user file
     */
}

/**
 * @brief SD Abort callbacks
 * @param hsd Pointer SD handle
 * @retval None
 */
__weak void HAL_SD_AbortCallback(SD_HandleTypeDef* hsd)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hsd);

    /* NOTE : This function should not be modified, when the callback is needed,
              the HAL_SD_AbortCallback can be implemented in the user file
     */
}

#if defined(USE_HAL_SD_REGISTER_CALLBACKS) && (USE_HAL_SD_REGISTER_CALLBACKS == 1U)
/**
 * @brief  Register a User SD Callback
 *         To be used instead of the weak (surcharged) predefined callback
 * @param hsd : SD handle
 * @param CallbackID : ID of the callback to be registered
 *        This parameter can be one of the following values:
 *          @arg @ref HAL_SD_TX_CPLT_CB_ID                 SD Tx Complete Callback ID
 *          @arg @ref HAL_SD_RX_CPLT_CB_ID                 SD Rx Complete Callback ID
 *          @arg @ref HAL_SD_ERROR_CB_ID                   SD Error Callback ID
 *          @arg @ref HAL_SD_ABORT_CB_ID                   SD Abort Callback ID
 *          @arg @ref HAL_SD_READ_DMA_DBL_BUF0_CPLT_CB_ID  SD DMA Rx Double buffer 0 Callback ID
 *          @arg @ref HAL_SD_READ_DMA_DBL_BUF1_CPLT_CB_ID  SD DMA Rx Double buffer 1 Callback ID
 *          @arg @ref HAL_SD_WRITE_DMA_DBL_BUF0_CPLT_CB_ID SD DMA Tx Double buffer 0 Callback ID
 *          @arg @ref HAL_SD_WRITE_DMA_DBL_BUF1_CPLT_CB_ID SD DMA Tx Double buffer 1 Callback ID
 *          @arg @ref HAL_SD_MSP_INIT_CB_ID                SD MspInit Callback ID
 *          @arg @ref HAL_SD_MSP_DEINIT_CB_ID              SD MspDeInit Callback ID
 * @param pCallback : pointer to the Callback function
 * @retval status
 */
HAL_StatusTypeDef HAL_SD_RegisterCallback(SD_HandleTypeDef*        hsd,
                                          HAL_SD_CallbackIDTypeDef CallbackID,
                                          pSD_CallbackTypeDef      pCallback)
{
    HAL_StatusTypeDef status = HAL_OK;

    if (pCallback == NULL)
    {
        /* Update the error code */
        hsd->ErrorCode |= HAL_SD_ERROR_INVALID_CALLBACK;
        return HAL_ERROR;
    }

    /* Process locked */
    __HAL_LOCK(hsd);

    if (hsd->State == HAL_SD_STATE_READY)
    {
        switch (CallbackID)
        {
            case HAL_SD_TX_CPLT_CB_ID:
                hsd->TxCpltCallback = pCallback;
                break;
            case HAL_SD_RX_CPLT_CB_ID:
                hsd->RxCpltCallback = pCallback;
                break;
            case HAL_SD_ERROR_CB_ID:
                hsd->ErrorCallback = pCallback;
                break;
            case HAL_SD_ABORT_CB_ID:
                hsd->AbortCpltCallback = pCallback;
                break;
#if defined(STM32L4P5xx) || defined(STM32L4Q5xx) || defined(STM32L4R5xx) ||                        \
  defined(STM32L4R7xx) || defined(STM32L4R9xx) || defined(STM32L4S5xx) || defined(STM32L4S7xx) ||  \
  defined(STM32L4S9xx)
            case HAL_SD_READ_DMA_DBL_BUF0_CPLT_CB_ID:
                hsd->Read_DMADblBuf0CpltCallback = pCallback;
                break;
            case HAL_SD_READ_DMA_DBL_BUF1_CPLT_CB_ID:
                hsd->Read_DMADblBuf1CpltCallback = pCallback;
                break;
            case HAL_SD_WRITE_DMA_DBL_BUF0_CPLT_CB_ID:
                hsd->Write_DMADblBuf0CpltCallback = pCallback;
                break;
            case HAL_SD_WRITE_DMA_DBL_BUF1_CPLT_CB_ID:
                hsd->Write_DMADblBuf1CpltCallback = pCallback;
                break;
#endif
            case HAL_SD_MSP_INIT_CB_ID:
                hsd->MspInitCallback = pCallback;
                break;
            case HAL_SD_MSP_DEINIT_CB_ID:
                hsd->MspDeInitCallback = pCallback;
                break;
            default:
                /* Update the error code */
                hsd->ErrorCode |= HAL_SD_ERROR_INVALID_CALLBACK;
                /* update return status */
                status = HAL_ERROR;
                break;
        }
    }
    else if (hsd->State == HAL_SD_STATE_RESET)
    {
        switch (CallbackID)
        {
            case HAL_SD_MSP_INIT_CB_ID:
                hsd->MspInitCallback = pCallback;
                break;
            case HAL_SD_MSP_DEINIT_CB_ID:
                hsd->MspDeInitCallback = pCallback;
                break;
            default:
                /* Update the error code */
                hsd->ErrorCode |= HAL_SD_ERROR_INVALID_CALLBACK;
                /* update return status */
                status = HAL_ERROR;
                break;
        }
    }
    else
    {
        /* Update the error code */
        hsd->ErrorCode |= HAL_SD_ERROR_INVALID_CALLBACK;
        /* update return status */
        status = HAL_ERROR;
    }

    /* Release Lock */
    __HAL_UNLOCK(hsd);
    return status;
}

/**
 * @brief  Unregister a User SD Callback
 *         SD Callback is redirected to the weak (surcharged) predefined callback
 * @param hsd : SD handle
 * @param CallbackID : ID of the callback to be unregistered
 *        This parameter can be one of the following values:
 *          @arg @ref HAL_SD_TX_CPLT_CB_ID                 SD Tx Complete Callback ID
 *          @arg @ref HAL_SD_RX_CPLT_CB_ID                 SD Rx Complete Callback ID
 *          @arg @ref HAL_SD_ERROR_CB_ID                   SD Error Callback ID
 *          @arg @ref HAL_SD_ABORT_CB_ID                   SD Abort Callback ID
 *          @arg @ref HAL_SD_READ_DMA_DBL_BUF0_CPLT_CB_ID  SD DMA Rx Double buffer 0 Callback ID
 *          @arg @ref HAL_SD_READ_DMA_DBL_BUF1_CPLT_CB_ID  SD DMA Rx Double buffer 1 Callback ID
 *          @arg @ref HAL_SD_WRITE_DMA_DBL_BUF0_CPLT_CB_ID SD DMA Tx Double buffer 0 Callback ID
 *          @arg @ref HAL_SD_WRITE_DMA_DBL_BUF1_CPLT_CB_ID SD DMA Tx Double buffer 1 Callback ID
 *          @arg @ref HAL_SD_MSP_INIT_CB_ID                SD MspInit Callback ID
 *          @arg @ref HAL_SD_MSP_DEINIT_CB_ID              SD MspDeInit Callback ID
 * @retval status
 */
HAL_StatusTypeDef
HAL_SD_UnRegisterCallback(SD_HandleTypeDef* hsd, HAL_SD_CallbackIDTypeDef CallbackID)
{
    HAL_StatusTypeDef status = HAL_OK;

    /* Process locked */
    __HAL_LOCK(hsd);

    if (hsd->State == HAL_SD_STATE_READY)
    {
        switch (CallbackID)
        {
            case HAL_SD_TX_CPLT_CB_ID:
                hsd->TxCpltCallback = HAL_SD_TxCpltCallback;
                break;
            case HAL_SD_RX_CPLT_CB_ID:
                hsd->RxCpltCallback = HAL_SD_RxCpltCallback;
                break;
            case HAL_SD_ERROR_CB_ID:
                hsd->ErrorCallback = HAL_SD_ErrorCallback;
                break;
            case HAL_SD_ABORT_CB_ID:
                hsd->AbortCpltCallback = HAL_SD_AbortCallback;
                break;
#if defined(STM32L4P5xx) || defined(STM32L4Q5xx) || defined(STM32L4R5xx) ||                        \
  defined(STM32L4R7xx) || defined(STM32L4R9xx) || defined(STM32L4S5xx) || defined(STM32L4S7xx) ||  \
  defined(STM32L4S9xx)
            case HAL_SD_READ_DMA_DBL_BUF0_CPLT_CB_ID:
                hsd->Read_DMADblBuf0CpltCallback = HAL_SDEx_Read_DMADoubleBuffer0CpltCallback;
                break;
            case HAL_SD_READ_DMA_DBL_BUF1_CPLT_CB_ID:
                hsd->Read_DMADblBuf1CpltCallback = HAL_SDEx_Read_DMADoubleBuffer1CpltCallback;
                break;
            case HAL_SD_WRITE_DMA_DBL_BUF0_CPLT_CB_ID:
                hsd->Write_DMADblBuf0CpltCallback = HAL_SDEx_Write_DMADoubleBuffer0CpltCallback;
                break;
            case HAL_SD_WRITE_DMA_DBL_BUF1_CPLT_CB_ID:
                hsd->Write_DMADblBuf1CpltCallback = HAL_SDEx_Write_DMADoubleBuffer1CpltCallback;
                break;
#endif
            case HAL_SD_MSP_INIT_CB_ID:
                hsd->MspInitCallback = HAL_SD_MspInit;
                break;
            case HAL_SD_MSP_DEINIT_CB_ID:
                hsd->MspDeInitCallback = HAL_SD_MspDeInit;
                break;
            default:
                /* Update the error code */
                hsd->ErrorCode |= HAL_SD_ERROR_INVALID_CALLBACK;
                /* update return status */
                status = HAL_ERROR;
                break;
        }
    }
    else if (hsd->State == HAL_SD_STATE_RESET)
    {
        switch (CallbackID)
        {
            case HAL_SD_MSP_INIT_CB_ID:
                hsd->MspInitCallback = HAL_SD_MspInit;
                break;
            case HAL_SD_MSP_DEINIT_CB_ID:
                hsd->MspDeInitCallback = HAL_SD_MspDeInit;
                break;
            default:
                /* Update the error code */
                hsd->ErrorCode |= HAL_SD_ERROR_INVALID_CALLBACK;
                /* update return status */
                status = HAL_ERROR;
                break;
        }
    }
    else
    {
        /* Update the error code */
        hsd->ErrorCode |= HAL_SD_ERROR_INVALID_CALLBACK;
        /* update return status */
        status = HAL_ERROR;
    }

    /* Release Lock */
    __HAL_UNLOCK(hsd);
    return status;
}

#if defined(STM32L4P5xx) || defined(STM32L4Q5xx) || defined(STM32L4R5xx) ||                        \
  defined(STM32L4R7xx) || defined(STM32L4R9xx) || defined(STM32L4S5xx) || defined(STM32L4S7xx) ||  \
  defined(STM32L4S9xx)
/**
 * @brief  Register a User SD Transceiver Callback
 *         To be used instead of the weak (surcharged) predefined callback
 * @param hsd : SD handle
 * @param pCallback : pointer to the Callback function
 * @retval status
 */
HAL_StatusTypeDef
HAL_SD_RegisterTransceiverCallback(SD_HandleTypeDef* hsd, pSD_TransceiverCallbackTypeDef pCallback)
{
    HAL_StatusTypeDef status = HAL_OK;

    if (pCallback == NULL)
    {
        /* Update the error code */
        hsd->ErrorCode |= HAL_SD_ERROR_INVALID_CALLBACK;
        return HAL_ERROR;
    }

    /* Process locked */
    __HAL_LOCK(hsd);

    if (hsd->State == HAL_SD_STATE_READY)
    {
        hsd->DriveTransceiver_1_8V_Callback = pCallback;
    }
    else
    {
        /* Update the error code */
        hsd->ErrorCode |= HAL_SD_ERROR_INVALID_CALLBACK;
        /* update return status */
        status = HAL_ERROR;
    }

    /* Release Lock */
    __HAL_UNLOCK(hsd);
    return status;
}

/**
 * @brief  Unregister a User SD Transceiver Callback
 *         SD Callback is redirected to the weak (surcharged) predefined callback
 * @param hsd : SD handle
 * @retval status
 */
HAL_StatusTypeDef HAL_SD_UnRegisterTransceiverCallback(SD_HandleTypeDef* hsd)
{
    HAL_StatusTypeDef status = HAL_OK;

    /* Process locked */
    __HAL_LOCK(hsd);

    if (hsd->State == HAL_SD_STATE_READY)
    {
        hsd->DriveTransceiver_1_8V_Callback = HAL_SDEx_DriveTransceiver_1_8V_Callback;
    }
    else
    {
        /* Update the error code */
        hsd->ErrorCode |= HAL_SD_ERROR_INVALID_CALLBACK;
        /* update return status */
        status = HAL_ERROR;
    }

    /* Release Lock */
    __HAL_UNLOCK(hsd);
    return status;
}
#endif
#endif /* USE_HAL_SD_REGISTER_CALLBACKS */

/**
 * @}
 */

/** @addtogroup SD_Exported_Functions_Group3
 *  @brief   management functions
 *
@verbatim
  ==============================================================================
                      ##### Peripheral Control functions #####
  ==============================================================================
  [..]
    This subsection provides a set of functions allowing to control the SD card
    operations and get the related information

@endverbatim
  * @{
  */

/**
 * @brief  Returns information the information of the card which are stored on
 *         the CID register.
 * @param  hsd Pointer to SD handle
 * @param  pCID Pointer to a HAL_SD_CardCIDTypeDef structure that
 *         contains all CID register parameters
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_SD_GetCardCID(SD_HandleTypeDef* hsd, HAL_SD_CardCIDTypeDef* pCID)
{
    pCID->ManufacturerID = (uint8_t)((hsd->CID[0] & 0xFF000000U) >> 24U);

