smartel99/NilaiTFO/bsp/stm32l4xx_hal_sd.cpp
    pCID->OEM_AppliID = (uint16_t)((hsd->CID[0] & 0x00FFFF00U) >> 8U);

    pCID->ProdName1 = (((hsd->CID[0] & 0x000000FFU) << 24U) | ((hsd->CID[1] & 0xFFFFFF00U) >> 8U));

    pCID->ProdName2 = (uint8_t)(hsd->CID[1] & 0x000000FFU);

    pCID->ProdRev = (uint8_t)((hsd->CID[2] & 0xFF000000U) >> 24U);

    pCID->ProdSN = (((hsd->CID[2] & 0x00FFFFFFU) << 8U) | ((hsd->CID[3] & 0xFF000000U) >> 24U));

    pCID->Reserved1 = (uint8_t)((hsd->CID[3] & 0x00F00000U) >> 20U);

    pCID->ManufactDate = (uint16_t)((hsd->CID[3] & 0x000FFF00U) >> 8U);

    pCID->CID_CRC = (uint8_t)((hsd->CID[3] & 0x000000FEU) >> 1U);

    pCID->Reserved2 = 1U;

    return HAL_OK;
}

/**
 * @brief  Returns information the information of the card which are stored on
 *         the CSD register.
 * @param  hsd Pointer to SD handle
 * @param  pCSD Pointer to a HAL_SD_CardCSDTypeDef structure that
 *         contains all CSD register parameters
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_SD_GetCardCSD(SD_HandleTypeDef* hsd, HAL_SD_CardCSDTypeDef* pCSD)
{
    pCSD->CSDStruct = (uint8_t)((hsd->CSD[0] & 0xC0000000U) >> 30U);

    pCSD->SysSpecVersion = (uint8_t)((hsd->CSD[0] & 0x3C000000U) >> 26U);

    pCSD->Reserved1 = (uint8_t)((hsd->CSD[0] & 0x03000000U) >> 24U);

    pCSD->TAAC = (uint8_t)((hsd->CSD[0] & 0x00FF0000U) >> 16U);

    pCSD->NSAC = (uint8_t)((hsd->CSD[0] & 0x0000FF00U) >> 8U);

    pCSD->MaxBusClkFrec = (uint8_t)(hsd->CSD[0] & 0x000000FFU);

    pCSD->CardComdClasses = (uint16_t)((hsd->CSD[1] & 0xFFF00000U) >> 20U);

    pCSD->RdBlockLen = (uint8_t)((hsd->CSD[1] & 0x000F0000U) >> 16U);

    pCSD->PartBlockRead = (uint8_t)((hsd->CSD[1] & 0x00008000U) >> 15U);

    pCSD->WrBlockMisalign = (uint8_t)((hsd->CSD[1] & 0x00004000U) >> 14U);

    pCSD->RdBlockMisalign = (uint8_t)((hsd->CSD[1] & 0x00002000U) >> 13U);

    pCSD->DSRImpl = (uint8_t)((hsd->CSD[1] & 0x00001000U) >> 12U);

    pCSD->Reserved2 = 0U; /*!< Reserved */

    if (hsd->SdCard.CardType == CARD_SDSC)
    {
        pCSD->DeviceSize =
          (((hsd->CSD[1] & 0x000003FFU) << 2U) | ((hsd->CSD[2] & 0xC0000000U) >> 30U));

        pCSD->MaxRdCurrentVDDMin = (uint8_t)((hsd->CSD[2] & 0x38000000U) >> 27U);

        pCSD->MaxRdCurrentVDDMax = (uint8_t)((hsd->CSD[2] & 0x07000000U) >> 24U);

        pCSD->MaxWrCurrentVDDMin = (uint8_t)((hsd->CSD[2] & 0x00E00000U) >> 21U);

        pCSD->MaxWrCurrentVDDMax = (uint8_t)((hsd->CSD[2] & 0x001C0000U) >> 18U);

        pCSD->DeviceSizeMul = (uint8_t)((hsd->CSD[2] & 0x00038000U) >> 15U);

        hsd->SdCard.BlockNbr = (pCSD->DeviceSize + 1U);
        hsd->SdCard.BlockNbr *= (1UL << ((pCSD->DeviceSizeMul & 0x07U) + 2U));
        hsd->SdCard.BlockSize = (1UL << (pCSD->RdBlockLen & 0x0FU));

        hsd->SdCard.LogBlockNbr  = (hsd->SdCard.BlockNbr) * ((hsd->SdCard.BlockSize) / 512U);
        hsd->SdCard.LogBlockSize = 512U;
    }
    else if (hsd->SdCard.CardType == CARD_SDHC_SDXC)
    {
        /* Byte 7 */
        pCSD->DeviceSize =
          (((hsd->CSD[1] & 0x0000003FU) << 16U) | ((hsd->CSD[2] & 0xFFFF0000U) >> 16U));

        hsd->SdCard.BlockNbr     = ((pCSD->DeviceSize + 1U) * 1024U);
        hsd->SdCard.LogBlockNbr  = hsd->SdCard.BlockNbr;
        hsd->SdCard.BlockSize    = 512U;
        hsd->SdCard.LogBlockSize = hsd->SdCard.BlockSize;
    }
    else
    {
        /* Clear all the static flags */
        __HAL_SD_CLEAR_FLAG(hsd, SDMMC_STATIC_FLAGS);
        hsd->ErrorCode |= HAL_SD_ERROR_UNSUPPORTED_FEATURE;
        hsd->State = HAL_SD_STATE_READY;
        return HAL_ERROR;
    }

    pCSD->EraseGrSize = (uint8_t)((hsd->CSD[2] & 0x00004000U) >> 14U);

    pCSD->EraseGrMul = (uint8_t)((hsd->CSD[2] & 0x00003F80U) >> 7U);

    pCSD->WrProtectGrSize = (uint8_t)(hsd->CSD[2] & 0x0000007FU);

    pCSD->WrProtectGrEnable = (uint8_t)((hsd->CSD[3] & 0x80000000U) >> 31U);

    pCSD->ManDeflECC = (uint8_t)((hsd->CSD[3] & 0x60000000U) >> 29U);

    pCSD->WrSpeedFact = (uint8_t)((hsd->CSD[3] & 0x1C000000U) >> 26U);

    pCSD->MaxWrBlockLen = (uint8_t)((hsd->CSD[3] & 0x03C00000U) >> 22U);

    pCSD->WriteBlockPaPartial = (uint8_t)((hsd->CSD[3] & 0x00200000U) >> 21U);

    pCSD->Reserved3 = 0;

    pCSD->ContentProtectAppli = (uint8_t)((hsd->CSD[3] & 0x00010000U) >> 16U);

    pCSD->FileFormatGroup = (uint8_t)((hsd->CSD[3] & 0x00008000U) >> 15U);

    pCSD->CopyFlag = (uint8_t)((hsd->CSD[3] & 0x00004000U) >> 14U);

    pCSD->PermWrProtect = (uint8_t)((hsd->CSD[3] & 0x00002000U) >> 13U);

    pCSD->TempWrProtect = (uint8_t)((hsd->CSD[3] & 0x00001000U) >> 12U);

    pCSD->FileFormat = (uint8_t)((hsd->CSD[3] & 0x00000C00U) >> 10U);

    pCSD->ECC = (uint8_t)((hsd->CSD[3] & 0x00000300U) >> 8U);

    pCSD->CSD_CRC = (uint8_t)((hsd->CSD[3] & 0x000000FEU) >> 1U);

    pCSD->Reserved4 = 1;

    return HAL_OK;
}

/**
 * @brief  Gets the SD status info.
 * @param  hsd Pointer to SD handle
 * @param  pStatus Pointer to the HAL_SD_CardStatusTypeDef structure that
 *         will contain the SD card status information
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_SD_GetCardStatus(SD_HandleTypeDef* hsd, HAL_SD_CardStatusTypeDef* pStatus)
{
    uint32_t          sd_status[16];
    uint32_t          errorstate;
    HAL_StatusTypeDef status = HAL_OK;

    errorstate = SD_SendSDStatus(hsd, sd_status);
    if (errorstate != HAL_SD_ERROR_NONE)
    {
        /* Clear all the static flags */
        __HAL_SD_CLEAR_FLAG(hsd, SDMMC_STATIC_FLAGS);
        hsd->ErrorCode |= errorstate;
        hsd->State = HAL_SD_STATE_READY;
        status     = HAL_ERROR;
    }
    else
    {
        pStatus->DataBusWidth = (uint8_t)((sd_status[0] & 0xC0U) >> 6U);

        pStatus->SecuredMode = (uint8_t)((sd_status[0] & 0x20U) >> 5U);

        pStatus->CardType =
          (uint16_t)(((sd_status[0] & 0x00FF0000U) >> 8U) | ((sd_status[0] & 0xFF000000U) >> 24U));

        pStatus->ProtectedAreaSize =
          (((sd_status[1] & 0xFFU) << 24U) | ((sd_status[1] & 0xFF00U) << 8U) |
           ((sd_status[1] & 0xFF0000U) >> 8U) | ((sd_status[1] & 0xFF000000U) >> 24U));

