smartel99/NilaiTFO/bsp/stm32l4xx_hal_sd.cpp
        pStatus->SpeedClass = (uint8_t)(sd_status[2] & 0xFFU);

        pStatus->PerformanceMove = (uint8_t)((sd_status[2] & 0xFF00U) >> 8U);

        pStatus->AllocationUnitSize = (uint8_t)((sd_status[2] & 0xF00000U) >> 20U);

        pStatus->EraseSize =
          (uint16_t)(((sd_status[2] & 0xFF000000U) >> 16U) | (sd_status[3] & 0xFFU));

        pStatus->EraseTimeout = (uint8_t)((sd_status[3] & 0xFC00U) >> 10U);

        pStatus->EraseOffset = (uint8_t)((sd_status[3] & 0x0300U) >> 8U);

#if defined(STM32L4P5xx) || defined(STM32L4Q5xx) || defined(STM32L4R5xx) ||                        \
  defined(STM32L4R7xx) || defined(STM32L4R9xx) || defined(STM32L4S5xx) || defined(STM32L4S7xx) ||  \
  defined(STM32L4S9xx)
        pStatus->UhsSpeedGrade         = (uint8_t)((sd_status[3] & 0x00F0U) >> 4U);
        pStatus->UhsAllocationUnitSize = (uint8_t)(sd_status[3] & 0x000FU);
        pStatus->VideoSpeedClass       = (uint8_t)((sd_status[4] & 0xFF000000U) >> 24U);
#endif
    }

    /* Set Block Size for Card */
    errorstate = SDMMC_CmdBlockLength(hsd->Instance, BLOCKSIZE);
    if (errorstate != HAL_SD_ERROR_NONE)
    {
        /* Clear all the static flags */
        __HAL_SD_CLEAR_FLAG(hsd, SDMMC_STATIC_FLAGS);
        hsd->ErrorCode = errorstate;
        hsd->State     = HAL_SD_STATE_READY;
        status         = HAL_ERROR;
    }

    return status;
}

/**
 * @brief  Gets the SD card info.
 * @param  hsd Pointer to SD handle
 * @param  pCardInfo Pointer to the HAL_SD_CardInfoTypeDef structure that
 *         will contain the SD card status information
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_SD_GetCardInfo(SD_HandleTypeDef* hsd, HAL_SD_CardInfoTypeDef* pCardInfo)
{
    pCardInfo->CardType     = (uint32_t)(hsd->SdCard.CardType);
    pCardInfo->CardVersion  = (uint32_t)(hsd->SdCard.CardVersion);
    pCardInfo->Class        = (uint32_t)(hsd->SdCard.Class);
    pCardInfo->RelCardAdd   = (uint32_t)(hsd->SdCard.RelCardAdd);
    pCardInfo->BlockNbr     = (uint32_t)(hsd->SdCard.BlockNbr);
    pCardInfo->BlockSize    = (uint32_t)(hsd->SdCard.BlockSize);
    pCardInfo->LogBlockNbr  = (uint32_t)(hsd->SdCard.LogBlockNbr);
    pCardInfo->LogBlockSize = (uint32_t)(hsd->SdCard.LogBlockSize);

    return HAL_OK;
}

/**
 * @brief  Enables wide bus operation for the requested card if supported by
 *         card.
 * @param  hsd Pointer to SD handle
 * @param  WideMode Specifies the SD card wide bus mode
 *          This parameter can be one of the following values:
 *            @arg SDMMC_BUS_WIDE_8B: 8-bit data transfer
 *            @arg SDMMC_BUS_WIDE_4B: 4-bit data transfer
 *            @arg SDMMC_BUS_WIDE_1B: 1-bit data transfer
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_SD_ConfigWideBusOperation(SD_HandleTypeDef* hsd, uint32_t WideMode)
{
    SDMMC_InitTypeDef Init;
    uint32_t          errorstate;
    HAL_StatusTypeDef status = HAL_OK;

    /* Check the parameters */
    assert_param(IS_SDMMC_BUS_WIDE(WideMode));

    /* Change State */
    hsd->State = HAL_SD_STATE_BUSY;

    if (hsd->SdCard.CardType != CARD_SECURED)
    {
        if (WideMode == SDMMC_BUS_WIDE_8B)
        {
            hsd->ErrorCode |= HAL_SD_ERROR_UNSUPPORTED_FEATURE;
        }
        else if (WideMode == SDMMC_BUS_WIDE_4B)
        {
            errorstate = SD_WideBus_Enable(hsd);

            hsd->ErrorCode |= errorstate;
        }
        else if (WideMode == SDMMC_BUS_WIDE_1B)
        {
            errorstate = SD_WideBus_Disable(hsd);

            hsd->ErrorCode |= errorstate;
        }
        else
        {
            /* WideMode is not a valid argument*/
            hsd->ErrorCode |= HAL_SD_ERROR_PARAM;
        }
    }
    else
    {
        /* MMC Card does not support this feature */
        hsd->ErrorCode |= HAL_SD_ERROR_UNSUPPORTED_FEATURE;
    }

    if (hsd->ErrorCode != HAL_SD_ERROR_NONE)
    {
        /* Clear all the static flags */
        __HAL_SD_CLEAR_FLAG(hsd, SDMMC_STATIC_FLAGS);
        status = HAL_ERROR;
    }
    else
    {
        /* Configure the SDMMC peripheral */
        Init.ClockEdge = hsd->Init.ClockEdge;
#if !defined(STM32L4P5xx) && !defined(STM32L4Q5xx) && !defined(STM32L4R5xx) &&                     \
  !defined(STM32L4R7xx) && !defined(STM32L4R9xx) && !defined(STM32L4S5xx) &&                       \
  !defined(STM32L4S7xx) && !defined(STM32L4S9xx)
        Init.ClockBypass = hsd->Init.ClockBypass;
#endif /* !STM32L4P5xx && !STM32L4Q5xx && !STM32L4R5xx && !STM32L4R7xx && !STM32L4R9xx &&          \
          !STM32L4S5xx && !STM32L4S7xx && !STM32L4S9xx */
        Init.ClockPowerSave      = hsd->Init.ClockPowerSave;
        Init.BusWide             = WideMode;
        Init.HardwareFlowControl = hsd->Init.HardwareFlowControl;

#if defined(STM32L4P5xx) || defined(STM32L4Q5xx) || defined(STM32L4R5xx) ||                        \
  defined(STM32L4R7xx) || defined(STM32L4R9xx) || defined(STM32L4S5xx) || defined(STM32L4S7xx) ||  \
  defined(STM32L4S9xx)
        /* Check if user Clock div < Normal speed 25Mhz, no change in Clockdiv */
        if (hsd->Init.ClockDiv >= SDMMC_NSpeed_CLK_DIV)
        {
            Init.ClockDiv = hsd->Init.ClockDiv;
        }
        else if (hsd->SdCard.CardSpeed == CARD_ULTRA_HIGH_SPEED)
        {
            /* UltraHigh speed SD card,user Clock div */
            Init.ClockDiv = hsd->Init.ClockDiv;
        }
        else if (hsd->SdCard.CardSpeed == CARD_HIGH_SPEED)
        {
            /* High speed SD card, Max Frequency = 50Mhz */
            Init.ClockDiv = SDMMC_HSpeed_CLK_DIV;
        }
        else
        {
            /* No High speed SD card, Max Frequency = 25Mhz */
            Init.ClockDiv = SDMMC_NSpeed_CLK_DIV;
        }
#else
        Init.ClockDiv = hsd->Init.ClockDiv;
#endif /* STM32L4P5xx || STM32L4Q5xx || STM32L4R5xx || STM32L4R7xx || STM32L4R9xx || STM32L4S5xx   \
          || STM32L4S7xx || STM32L4S9xx */

        (void)SDMMC_Init(hsd->Instance, Init);
    }

    /* Set Block Size for Card */
    errorstate = SDMMC_CmdBlockLength(hsd->Instance, BLOCKSIZE);
    if (errorstate != HAL_SD_ERROR_NONE)
    {
        /* Clear all the static flags */
        __HAL_SD_CLEAR_FLAG(hsd, SDMMC_STATIC_FLAGS);
        hsd->ErrorCode |= errorstate;
        status = HAL_ERROR;
    }

