smartel99/NilaiTFO/bsp/stm32l4xx_hal_sd.cpp
    /* Change State */
    hsd->State = HAL_SD_STATE_READY;

    return status;
}

#if defined(STM32L4P5xx) || defined(STM32L4Q5xx) || defined(STM32L4R5xx) ||                        \
  defined(STM32L4R7xx) || defined(STM32L4R9xx) || defined(STM32L4S5xx) || defined(STM32L4S7xx) ||  \
  defined(STM32L4S9xx)
/**
 * @brief  Configure the speed bus mode
 * @param  hsd Pointer to the SD handle
 * @param  SpeedMode Specifies the SD card speed bus mode
 *          This parameter can be one of the following values:
 *            @arg SDMMC_SPEED_MODE_AUTO: Max speed mode supported by the card
 *            @arg SDMMC_SPEED_MODE_DEFAULT: Default Speed/SDR12 mode
 *            @arg SDMMC_SPEED_MODE_HIGH: High Speed/SDR25 mode
 *            @arg SDMMC_SPEED_MODE_ULTRA: Ultra high speed mode
 * @retval HAL status
 */

HAL_StatusTypeDef HAL_SD_ConfigSpeedBusOperation(SD_HandleTypeDef* hsd, uint32_t SpeedMode)
{
    uint32_t          tickstart;
    uint32_t          errorstate;
    HAL_StatusTypeDef status = HAL_OK;

    /* Check the parameters */
    assert_param(IS_SDMMC_SPEED_MODE(SpeedMode));
    /* Change State */
    hsd->State = HAL_SD_STATE_BUSY;

    if (hsd->Init.Transceiver == SDMMC_TRANSCEIVER_ENABLE)
    {
        switch (SpeedMode)
        {
            case SDMMC_SPEED_MODE_AUTO:
            {
                if ((hsd->SdCard.CardSpeed == CARD_ULTRA_HIGH_SPEED) ||
                    (hsd->SdCard.CardType == CARD_SDHC_SDXC))
                {
                    hsd->Instance->CLKCR |= 0x00100000U;
                    /* Enable Ultra High Speed */
                    if (SD_UltraHighSpeed(hsd) != HAL_SD_ERROR_NONE)
                    {
                        if (SD_HighSpeed(hsd) != HAL_SD_ERROR_NONE)
                        {
                            hsd->ErrorCode |= HAL_SD_ERROR_UNSUPPORTED_FEATURE;
                            status = HAL_ERROR;
                        }
                    }
                }
                else if (hsd->SdCard.CardSpeed == CARD_HIGH_SPEED)
                {
                    /* Enable High Speed */
                    if (SD_HighSpeed(hsd) != HAL_SD_ERROR_NONE)
                    {
                        hsd->ErrorCode |= HAL_SD_ERROR_UNSUPPORTED_FEATURE;
                        status = HAL_ERROR;
                    }
                }
                else
                {
                    /*Nothing to do, Use defaultSpeed */
                }
                break;
            }

            case SDMMC_SPEED_MODE_ULTRA:
            {
                if ((hsd->SdCard.CardSpeed == CARD_ULTRA_HIGH_SPEED) ||
                    (hsd->SdCard.CardType == CARD_SDHC_SDXC))
                {
                    hsd->Instance->CLKCR |= 0x00100000U;
                    /* Enable UltraHigh Speed */
                    if (SD_UltraHighSpeed(hsd) != HAL_SD_ERROR_NONE)
                    {
                        hsd->ErrorCode |= HAL_SD_ERROR_UNSUPPORTED_FEATURE;
                        status = HAL_ERROR;
                    }
                }
                else
                {
                    hsd->ErrorCode |= HAL_SD_ERROR_UNSUPPORTED_FEATURE;
                    status = HAL_ERROR;
                }
                break;
            }

            case SDMMC_SPEED_MODE_DDR:
            {
                if ((hsd->SdCard.CardSpeed == CARD_ULTRA_HIGH_SPEED) ||
                    (hsd->SdCard.CardType == CARD_SDHC_SDXC))
                {
                    hsd->Instance->CLKCR |= 0x00100000U;
                    /* Enable DDR Mode*/
                    if (SD_DDR_Mode(hsd) != HAL_SD_ERROR_NONE)
                    {
                        hsd->ErrorCode |= HAL_SD_ERROR_UNSUPPORTED_FEATURE;
                        status = HAL_ERROR;
                    }
                }
                else
                {
                    hsd->ErrorCode |= HAL_SD_ERROR_UNSUPPORTED_FEATURE;
                    status = HAL_ERROR;
                }
                break;
            }

            case SDMMC_SPEED_MODE_HIGH:
            {
                if ((hsd->SdCard.CardSpeed == CARD_ULTRA_HIGH_SPEED) ||
                    (hsd->SdCard.CardSpeed == CARD_HIGH_SPEED) ||
                    (hsd->SdCard.CardType == CARD_SDHC_SDXC))
                {
                    /* Enable High Speed */
                    if (SD_HighSpeed(hsd) != HAL_SD_ERROR_NONE)
                    {
                        hsd->ErrorCode |= HAL_SD_ERROR_UNSUPPORTED_FEATURE;
                        status = HAL_ERROR;
                    }
                }
                else
                {
                    hsd->ErrorCode |= HAL_SD_ERROR_UNSUPPORTED_FEATURE;
                    status = HAL_ERROR;
                }
                break;
            }

            case SDMMC_SPEED_MODE_DEFAULT:
                break;

            default:
                hsd->ErrorCode |= HAL_SD_ERROR_PARAM;
                status = HAL_ERROR;
                break;
        }
    }
    else
    {
        switch (SpeedMode)
        {
            case SDMMC_SPEED_MODE_AUTO:
            {
                if ((hsd->SdCard.CardSpeed == CARD_ULTRA_HIGH_SPEED) ||
                    (hsd->SdCard.CardSpeed == CARD_HIGH_SPEED) ||
                    (hsd->SdCard.CardType == CARD_SDHC_SDXC))
                {
                    /* Enable High Speed */
                    if (SD_HighSpeed(hsd) != HAL_SD_ERROR_NONE)
                    {
                        hsd->ErrorCode |= HAL_SD_ERROR_UNSUPPORTED_FEATURE;
                        status = HAL_ERROR;
                    }
                }
                else
                {
                    /*Nothing to do, Use defaultSpeed */
                }
                break;
            }

            case SDMMC_SPEED_MODE_HIGH:
            {
                if ((hsd->SdCard.CardSpeed == CARD_ULTRA_HIGH_SPEED) ||
                    (hsd->SdCard.CardSpeed == CARD_HIGH_SPEED) ||
                    (hsd->SdCard.CardType == CARD_SDHC_SDXC))
                {
                    /* Enable High Speed */
                    if (SD_HighSpeed(hsd) != HAL_SD_ERROR_NONE)
                    {
                        hsd->ErrorCode |= HAL_SD_ERROR_UNSUPPORTED_FEATURE;
                        status = HAL_ERROR;
                    }
                }
                else
                {
                    hsd->ErrorCode |= HAL_SD_ERROR_UNSUPPORTED_FEATURE;
                    status = HAL_ERROR;
                }
                break;
            }

            case SDMMC_SPEED_MODE_DEFAULT:
                break;

            case SDMMC_SPEED_MODE_ULTRA: /*not valid without transceiver*/
            default:
                hsd->ErrorCode |= HAL_SD_ERROR_PARAM;
                status = HAL_ERROR;
                break;
        }
    }

    /* Verify that SD card is ready to use after Speed mode switch*/
    tickstart = HAL_GetTick();
    while ((HAL_SD_GetCardState(hsd) != HAL_SD_CARD_TRANSFER))
    {
        if ((HAL_GetTick() - tickstart) >= SDMMC_DATATIMEOUT)
        {
            hsd->ErrorCode = HAL_SD_ERROR_TIMEOUT;
            hsd->State     = HAL_SD_STATE_READY;
            return HAL_TIMEOUT;
        }
    }

    /* Set Block Size for Card */
    errorstate = SDMMC_CmdBlockLength(hsd->Instance, BLOCKSIZE);
    if (errorstate != HAL_SD_ERROR_NONE)
    {
        /* Clear all the static flags */
        __HAL_SD_CLEAR_FLAG(hsd, SDMMC_STATIC_FLAGS);
        hsd->ErrorCode |= errorstate;
        status = HAL_ERROR;
    }

