smartel99/NilaiTFO/bsp/stm32l4xx_hal_sd.cpp
    /* Change State */
    hsd->State = HAL_SD_STATE_READY;
    return status;
}
#endif /* STM32L4P5xx || STM32L4Q5xx || STM32L4R5xx || STM32L4R7xx || STM32L4R9xx || STM32L4S5xx   \
          || STM32L4S7xx || STM32L4S9xx */

/**
 * @brief  Gets the current sd card data state.
 * @param  hsd pointer to SD handle
 * @retval Card state
 */
HAL_SD_CardStateTypeDef HAL_SD_GetCardState(SD_HandleTypeDef* hsd)
{
    uint32_t cardstate;
    uint32_t errorstate;
    uint32_t resp1 = 0;

    errorstate = SD_SendStatus(hsd, &resp1);
    if (errorstate != HAL_SD_ERROR_NONE)
    {
        hsd->ErrorCode |= errorstate;
    }

    cardstate = ((resp1 >> 9U) & 0x0FU);

    return (HAL_SD_CardStateTypeDef)cardstate;
}

/**
 * @brief  Abort the current transfer and disable the SD.
 * @param  hsd pointer to a SD_HandleTypeDef structure that contains
 *                the configuration information for SD module.
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_SD_Abort(SD_HandleTypeDef* hsd)
{
    HAL_SD_CardStateTypeDef CardState;
#if !defined(STM32L4P5xx) && !defined(STM32L4Q5xx) && !defined(STM32L4R5xx) &&                     \
  !defined(STM32L4R7xx) && !defined(STM32L4R9xx) && !defined(STM32L4S5xx) &&                       \
  !defined(STM32L4S7xx) && !defined(STM32L4S9xx)
    uint32_t context = hsd->Context;
#endif

    /* DIsable All interrupts */
    __HAL_SD_DISABLE_IT(hsd,
                        SDMMC_IT_DATAEND | SDMMC_IT_DCRCFAIL | SDMMC_IT_DTIMEOUT |
                          SDMMC_IT_TXUNDERR | SDMMC_IT_RXOVERR);

    /* Clear All flags */
    __HAL_SD_CLEAR_FLAG(hsd, SDMMC_STATIC_DATA_FLAGS);

#if defined(STM32L4P5xx) || defined(STM32L4Q5xx) || defined(STM32L4R5xx) ||                        \
  defined(STM32L4R7xx) || defined(STM32L4R9xx) || defined(STM32L4S5xx) || defined(STM32L4S7xx) ||  \
  defined(STM32L4S9xx)
    /* If IDMA Context, disable Internal DMA */
    hsd->Instance->IDMACTRL = SDMMC_DISABLE_IDMA;
#else
    CLEAR_BIT(hsd->Instance->DCTRL, SDMMC_DCTRL_DTEN);

    if ((context & SD_CONTEXT_DMA) != 0U)
    {
        /* Disable the SD DMA request */
        hsd->Instance->DCTRL &= (uint32_t) ~((uint32_t)SDMMC_DCTRL_DMAEN);

        /* Abort the SD DMA Tx channel */
        if (((context & SD_CONTEXT_WRITE_SINGLE_BLOCK) != 0U) ||
            ((context & SD_CONTEXT_WRITE_MULTIPLE_BLOCK) != 0U))
        {
            if (HAL_DMA_Abort(hsd->hdmatx) != HAL_OK)
            {
                hsd->ErrorCode |= HAL_SD_ERROR_DMA;
            }
        }
        /* Abort the SD DMA Rx channel */
        else if (((context & SD_CONTEXT_READ_SINGLE_BLOCK) != 0U) ||
                 ((context & SD_CONTEXT_READ_MULTIPLE_BLOCK) != 0U))
        {
            if (HAL_DMA_Abort(hsd->hdmarx) != HAL_OK)
            {
                hsd->ErrorCode |= HAL_SD_ERROR_DMA;
            }
        }
        else
        {
            /* Nothing to do */
        }
    }
#endif /* STM32L4P5xx || STM32L4Q5xx || STM32L4R5xx || STM32L4R7xx || STM32L4R9xx || STM32L4S5xx   \
          || STM32L4S7xx || STM32L4S9xx */

    hsd->State = HAL_SD_STATE_READY;

    /* Initialize the SD operation */
    hsd->Context = SD_CONTEXT_NONE;

    CardState = HAL_SD_GetCardState(hsd);
    if ((CardState == HAL_SD_CARD_RECEIVING) || (CardState == HAL_SD_CARD_SENDING))
    {
        hsd->ErrorCode = SDMMC_CmdStopTransfer(hsd->Instance);
    }
    if (hsd->ErrorCode != HAL_SD_ERROR_NONE)
    {
        return HAL_ERROR;
    }
    return HAL_OK;
}

/**
 * @brief  Abort the current transfer and disable the SD (IT mode).
 * @param  hsd pointer to a SD_HandleTypeDef structure that contains
 *                the configuration information for SD module.
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_SD_Abort_IT(SD_HandleTypeDef* hsd)
{
    HAL_SD_CardStateTypeDef CardState;
#if !defined(STM32L4P5xx) && !defined(STM32L4Q5xx) && !defined(STM32L4R5xx) &&                     \
  !defined(STM32L4R7xx) && !defined(STM32L4R9xx) && !defined(STM32L4S5xx) &&                       \
  !defined(STM32L4S7xx) && !defined(STM32L4S9xx)
    uint32_t context = hsd->Context;
#endif

    /* Disable All interrupts */
    __HAL_SD_DISABLE_IT(hsd,
                        SDMMC_IT_DATAEND | SDMMC_IT_DCRCFAIL | SDMMC_IT_DTIMEOUT |
                          SDMMC_IT_TXUNDERR | SDMMC_IT_RXOVERR);

#if defined(STM32L4P5xx) || defined(STM32L4Q5xx) || defined(STM32L4R5xx) ||                        \
  defined(STM32L4R7xx) || defined(STM32L4R9xx) || defined(STM32L4S5xx) || defined(STM32L4S7xx) ||  \
  defined(STM32L4S9xx)
    /* If IDMA Context, disable Internal DMA */
    hsd->Instance->IDMACTRL = SDMMC_DISABLE_IDMA;

    /* Clear All flags */
    __HAL_SD_CLEAR_FLAG(hsd, SDMMC_STATIC_DATA_FLAGS);

    CardState  = HAL_SD_GetCardState(hsd);
    hsd->State = HAL_SD_STATE_READY;

    if ((CardState == HAL_SD_CARD_RECEIVING) || (CardState == HAL_SD_CARD_SENDING))
    {
        hsd->ErrorCode = SDMMC_CmdStopTransfer(hsd->Instance);
    }

    if (hsd->ErrorCode != HAL_SD_ERROR_NONE)
    {
        return HAL_ERROR;
    }
    else
    {
#if defined(USE_HAL_SD_REGISTER_CALLBACKS) && (USE_HAL_SD_REGISTER_CALLBACKS == 1U)
        hsd->AbortCpltCallback(hsd);
#else
        HAL_SD_AbortCallback(hsd);
#endif /* USE_HAL_SD_REGISTER_CALLBACKS */
    }
#else
    CLEAR_BIT(hsd->Instance->DCTRL, SDMMC_DCTRL_DTEN);

    if ((context & SD_CONTEXT_DMA) != 0U)
    {
        /* Disable the SD DMA request */
        hsd->Instance->DCTRL &= (uint32_t) ~((uint32_t)SDMMC_DCTRL_DMAEN);

        /* Abort the SD DMA Tx channel */
        if (((context & SD_CONTEXT_WRITE_SINGLE_BLOCK) != 0U) ||
            ((context & SD_CONTEXT_WRITE_MULTIPLE_BLOCK) != 0U))
        {
            hsd->hdmatx->XferAbortCallback = SD_DMATxAbort;
            if (HAL_DMA_Abort_IT(hsd->hdmatx) != HAL_OK)
            {
                hsd->hdmatx = NULL;
            }
        }
        /* Abort the SD DMA Rx channel */
        else if (((context & SD_CONTEXT_READ_SINGLE_BLOCK) != 0U) ||
                 ((context & SD_CONTEXT_READ_MULTIPLE_BLOCK) != 0U))
        {
            hsd->hdmarx->XferAbortCallback = SD_DMARxAbort;
            if (HAL_DMA_Abort_IT(hsd->hdmarx) != HAL_OK)
            {
                hsd->hdmarx = NULL;
            }
        }
        else
        {
            /* Nothing to do */
        }
    }
    /* No transfer ongoing on both DMA channels*/
    else
    {
        /* Clear All flags */
        __HAL_SD_CLEAR_FLAG(hsd, SDMMC_STATIC_DATA_FLAGS);

        CardState    = HAL_SD_GetCardState(hsd);
        hsd->State   = HAL_SD_STATE_READY;
        hsd->Context = SD_CONTEXT_NONE;
        if ((CardState == HAL_SD_CARD_RECEIVING) || (CardState == HAL_SD_CARD_SENDING))
        {
            hsd->ErrorCode = SDMMC_CmdStopTransfer(hsd->Instance);
        }
        if (hsd->ErrorCode != HAL_SD_ERROR_NONE)
        {
            return HAL_ERROR;
        }
        else
        {
#if defined(USE_HAL_SD_REGISTER_CALLBACKS) && (USE_HAL_SD_REGISTER_CALLBACKS == 1U)
            hsd->AbortCpltCallback(hsd);
#else
            HAL_SD_AbortCallback(hsd);
#endif /* USE_HAL_SD_REGISTER_CALLBACKS */
        }
    }
#endif /* STM32L4P5xx || STM32L4Q5xx || STM32L4R5xx || STM32L4R7xx || STM32L4R9xx || STM32L4S5xx   \
          || STM32L4S7xx || STM32L4S9xx */

    return HAL_OK;
}

/**
 * @}
 */

/**
 * @}
 */

