smartel99/NilaiTFO/bsp/stm32l4xx_hal_sd.cpp
/* Private function ----------------------------------------------------------*/
/** @addtogroup SD_Private_Functions
 * @{
 */

#if !defined(STM32L4P5xx) && !defined(STM32L4Q5xx) && !defined(STM32L4R5xx) &&                     \
  !defined(STM32L4R7xx) && !defined(STM32L4R9xx) && !defined(STM32L4S5xx) &&                       \
  !defined(STM32L4S7xx) && !defined(STM32L4S9xx)
/**
 * @brief  DMA SD transmit process complete callback
 * @param  hdma DMA handle
 * @retval None
 */
static void SD_DMATransmitCplt(DMA_HandleTypeDef* hdma)
{
    SD_HandleTypeDef* hsd = (SD_HandleTypeDef*)(hdma->Parent);
    uint32_t          errorstate;

    /* Send stop command in multiblock write */
    if (hsd->Context == (SD_CONTEXT_WRITE_MULTIPLE_BLOCK | SD_CONTEXT_DMA))
    {
        errorstate = SDMMC_CmdStopTransfer(hsd->Instance);
        if (errorstate != HAL_SD_ERROR_NONE)
        {
            hsd->ErrorCode |= errorstate;
#if (USE_HAL_SD_REGISTER_CALLBACKS == 1)
            hsd->ErrorCallback(hsd);
#else
            HAL_SD_ErrorCallback(hsd);
#endif
        }
    }

    /* Disable the DMA transfer for transmit request by setting the DMAEN bit
        in the SD DCTRL register */
    hsd->Instance->DCTRL &= (uint32_t) ~((uint32_t)SDMMC_DCTRL_DMAEN);

    /* Clear all the static flags */
    __HAL_SD_CLEAR_FLAG(hsd, SDMMC_STATIC_DATA_FLAGS);

    hsd->State   = HAL_SD_STATE_READY;
    hsd->Context = SD_CONTEXT_NONE;

#if (USE_HAL_SD_REGISTER_CALLBACKS == 1)
    hsd->TxCpltCallback(hsd);
#else
    HAL_SD_TxCpltCallback(hsd);
#endif
}

/**
 * @brief  DMA SD receive process complete callback
 * @param  hdma DMA handle
 * @retval None
 */
static void SD_DMAReceiveCplt(DMA_HandleTypeDef* hdma)
{
    SD_HandleTypeDef* hsd = (SD_HandleTypeDef*)(hdma->Parent);
    uint32_t          errorstate;

    /* Send stop command in multiblock write */
    if (hsd->Context == (SD_CONTEXT_READ_MULTIPLE_BLOCK | SD_CONTEXT_DMA))
    {
        errorstate = SDMMC_CmdStopTransfer(hsd->Instance);
        if (errorstate != HAL_SD_ERROR_NONE)
        {
            hsd->ErrorCode |= errorstate;
#if (USE_HAL_SD_REGISTER_CALLBACKS == 1)
            hsd->ErrorCallback(hsd);
#else
            HAL_SD_ErrorCallback(hsd);
#endif
        }
    }

    /* Disable the DMA transfer for transmit request by setting the DMAEN bit
    in the SD DCTRL register */
    hsd->Instance->DCTRL &= (uint32_t) ~((uint32_t)SDMMC_DCTRL_DMAEN);

    /* Clear all the static flags */
    __HAL_SD_CLEAR_FLAG(hsd, SDMMC_STATIC_DATA_FLAGS);

    hsd->State   = HAL_SD_STATE_READY;
    hsd->Context = SD_CONTEXT_NONE;

#if (USE_HAL_SD_REGISTER_CALLBACKS == 1)
    hsd->RxCpltCallback(hsd);
#else
    HAL_SD_RxCpltCallback(hsd);
#endif
}

/**
 * @brief  DMA SD communication error callback
 * @param  hdma DMA handle
 * @retval None
 */
static void SD_DMAError(DMA_HandleTypeDef* hdma)
{
    SD_HandleTypeDef*       hsd = (SD_HandleTypeDef*)(hdma->Parent);
    HAL_SD_CardStateTypeDef CardState;
    uint32_t                RxErrorCode, TxErrorCode;

    RxErrorCode = hsd->hdmarx->ErrorCode;
    TxErrorCode = hsd->hdmatx->ErrorCode;
    if ((RxErrorCode == HAL_DMA_ERROR_TE) || (TxErrorCode == HAL_DMA_ERROR_TE))
    {
        /* Clear All flags */
        __HAL_SD_CLEAR_FLAG(hsd, SDMMC_STATIC_FLAGS);

        /* Disable All interrupts */
        __HAL_SD_DISABLE_IT(hsd,
                            SDMMC_IT_DATAEND | SDMMC_IT_DCRCFAIL | SDMMC_IT_DTIMEOUT |
                              SDMMC_IT_TXUNDERR | SDMMC_IT_RXOVERR);

        hsd->ErrorCode |= HAL_SD_ERROR_DMA;
        CardState = HAL_SD_GetCardState(hsd);
        if ((CardState == HAL_SD_CARD_RECEIVING) || (CardState == HAL_SD_CARD_SENDING))
        {
            hsd->ErrorCode |= SDMMC_CmdStopTransfer(hsd->Instance);
        }

        hsd->State   = HAL_SD_STATE_READY;
        hsd->Context = SD_CONTEXT_NONE;
    }

#if (USE_HAL_SD_REGISTER_CALLBACKS == 1)
    hsd->ErrorCallback(hsd);
#else
    HAL_SD_ErrorCallback(hsd);
#endif
}

/**
 * @brief  DMA SD Tx Abort callback
 * @param  hdma DMA handle
 * @retval None
 */
static void SD_DMATxAbort(DMA_HandleTypeDef* hdma)
{
    SD_HandleTypeDef*       hsd = (SD_HandleTypeDef*)(hdma->Parent);
    HAL_SD_CardStateTypeDef CardState;

    /* Clear All flags */
    __HAL_SD_CLEAR_FLAG(hsd, SDMMC_STATIC_DATA_FLAGS);

    CardState    = HAL_SD_GetCardState(hsd);
    hsd->State   = HAL_SD_STATE_READY;
    hsd->Context = SD_CONTEXT_NONE;
    if ((CardState == HAL_SD_CARD_RECEIVING) || (CardState == HAL_SD_CARD_SENDING))
    {
        hsd->ErrorCode |= SDMMC_CmdStopTransfer(hsd->Instance);
    }

    if (hsd->ErrorCode == HAL_SD_ERROR_NONE)
    {
#if (USE_HAL_SD_REGISTER_CALLBACKS == 1)
        hsd->AbortCpltCallback(hsd);
#else
        HAL_SD_AbortCallback(hsd);
#endif
    }
    else
    {
#if (USE_HAL_SD_REGISTER_CALLBACKS == 1)
        hsd->ErrorCallback(hsd);
#else
        HAL_SD_ErrorCallback(hsd);
#endif
    }
}

/**
 * @brief  DMA SD Rx Abort callback
 * @param  hdma DMA handle
 * @retval None
 */
static void SD_DMARxAbort(DMA_HandleTypeDef* hdma)
{
    SD_HandleTypeDef*       hsd = (SD_HandleTypeDef*)(hdma->Parent);
    HAL_SD_CardStateTypeDef CardState;

    /* Clear All flags */
    __HAL_SD_CLEAR_FLAG(hsd, SDMMC_STATIC_DATA_FLAGS);

    CardState    = HAL_SD_GetCardState(hsd);
    hsd->State   = HAL_SD_STATE_READY;
    hsd->Context = SD_CONTEXT_NONE;
    if ((CardState == HAL_SD_CARD_RECEIVING) || (CardState == HAL_SD_CARD_SENDING))
    {
        hsd->ErrorCode |= SDMMC_CmdStopTransfer(hsd->Instance);
    }

    if (hsd->ErrorCode == HAL_SD_ERROR_NONE)
    {
#if (USE_HAL_SD_REGISTER_CALLBACKS == 1)
        hsd->AbortCpltCallback(hsd);
#else
        HAL_SD_AbortCallback(hsd);
#endif
    }
    else
    {
#if (USE_HAL_SD_REGISTER_CALLBACKS == 1)
        hsd->ErrorCallback(hsd);
#else
        HAL_SD_ErrorCallback(hsd);
#endif
    }
}
#endif /* !STM32L4P5xx && !STM32L4Q5xx && !STM32L4R5xx && !STM32L4R7xx && !STM32L4R9xx &&          \
          !STM32L4S5xx && !STM32L4S7xx && !STM32L4S9xx */

/**
 * @brief  Initializes the sd card.
 * @param  hsd Pointer to SD handle
 * @retval SD Card error state
 */
static uint32_t SD_InitCard(SD_HandleTypeDef* hsd)
{
    HAL_SD_CardCSDTypeDef CSD;
    uint32_t              errorstate;
    uint16_t              sd_rca = 1U;

    /* Check the power State */
    if (SDMMC_GetPowerState(hsd->Instance) == 0U)
    {
        /* Power off */
        return HAL_SD_ERROR_REQUEST_NOT_APPLICABLE;
    }

