smartel99/NilaiTFO/bsp/stm32l4xx_hal_sd.cpp
    if (hsd->SdCard.CardType != CARD_SECURED)
    {
        /* Send CMD2 ALL_SEND_CID */
        errorstate = SDMMC_CmdSendCID(hsd->Instance);
        if (errorstate != HAL_SD_ERROR_NONE)
        {
            return errorstate;
        }
        else
        {
            /* Get Card identification number data */
            hsd->CID[0U] = SDMMC_GetResponse(hsd->Instance, SDMMC_RESP1);
            hsd->CID[1U] = SDMMC_GetResponse(hsd->Instance, SDMMC_RESP2);
            hsd->CID[2U] = SDMMC_GetResponse(hsd->Instance, SDMMC_RESP3);
            hsd->CID[3U] = SDMMC_GetResponse(hsd->Instance, SDMMC_RESP4);
        }
    }

    if (hsd->SdCard.CardType != CARD_SECURED)
    {
        /* Send CMD3 SET_REL_ADDR with argument 0 */
        /* SD Card publishes its RCA. */
        errorstate = SDMMC_CmdSetRelAdd(hsd->Instance, &sd_rca);
        if (errorstate != HAL_SD_ERROR_NONE)
        {
            return errorstate;
        }
    }
    if (hsd->SdCard.CardType != CARD_SECURED)
    {
        /* Get the SD card RCA */
        hsd->SdCard.RelCardAdd = sd_rca;

        /* Send CMD9 SEND_CSD with argument as card's RCA */
        errorstate = SDMMC_CmdSendCSD(hsd->Instance, (uint32_t)(hsd->SdCard.RelCardAdd << 16U));
        if (errorstate != HAL_SD_ERROR_NONE)
        {
            return errorstate;
        }
        else
        {
            /* Get Card Specific Data */
            hsd->CSD[0U] = SDMMC_GetResponse(hsd->Instance, SDMMC_RESP1);
            hsd->CSD[1U] = SDMMC_GetResponse(hsd->Instance, SDMMC_RESP2);
            hsd->CSD[2U] = SDMMC_GetResponse(hsd->Instance, SDMMC_RESP3);
            hsd->CSD[3U] = SDMMC_GetResponse(hsd->Instance, SDMMC_RESP4);
        }
    }

    /* Get the Card Class */
    hsd->SdCard.Class = (SDMMC_GetResponse(hsd->Instance, SDMMC_RESP2) >> 20U);

    /* GetField CSD parameters */
    if (HAL_SD_GetCardCSD(hsd, &CSD) != HAL_OK)
    {
        return HAL_SD_ERROR_UNSUPPORTED_FEATURE;
    }

    /* Select the Card */
    errorstate =
      SDMMC_CmdSelDesel(hsd->Instance, (uint32_t)(((uint32_t)hsd->SdCard.RelCardAdd) << 16U));
    if (errorstate != HAL_SD_ERROR_NONE)
    {
        return errorstate;
    }

#if !defined(STM32L4P5xx) && !defined(STM32L4Q5xx) && !defined(STM32L4R5xx) &&                     \
  !defined(STM32L4R7xx) && !defined(STM32L4R9xx) && !defined(STM32L4S5xx) &&                       \
  !defined(STM32L4S7xx) && !defined(STM32L4S9xx)
    /* Configure SDMMC peripheral interface */
    (void)SDMMC_Init(hsd->Instance, hsd->Init);
#endif /* !STM32L4P5xx && !STM32L4Q5xx && !STM32L4R5xx && !STM32L4R7xx && !STM32L4R9xx &&          \
          !STM32L4S5xx && !STM32L4S7xx && !STM32L4S9xx */

    /* All cards are initialized */
    return HAL_SD_ERROR_NONE;
}

/**
 * @brief  Enquires cards about their operating voltage and configures clock
 *         controls and stores SD information that will be needed in future
 *         in the SD handle.
 * @param  hsd Pointer to SD handle
 * @retval error state
 */
static uint32_t SD_PowerON(SD_HandleTypeDef* hsd)
{
    __IO uint32_t count    = 0U;
    uint32_t      response = 0U, validvoltage = 0U;
    uint32_t      errorstate;
#if defined(STM32L4P5xx) || defined(STM32L4Q5xx) || defined(STM32L4R5xx) ||                        \
  defined(STM32L4R7xx) || defined(STM32L4R9xx) || defined(STM32L4S5xx) || defined(STM32L4S7xx) ||  \
  defined(STM32L4S9xx)
    uint32_t tickstart = HAL_GetTick();
#endif /* STM32L4P5xx || STM32L4Q5xx || STM32L4R5xx || STM32L4R7xx || STM32L4R9xx || STM32L4S5xx   \
          || STM32L4S7xx || STM32L4S9xx */

    /* CMD0: GO_IDLE_STATE */
    errorstate = SDMMC_CmdGoIdleState(hsd->Instance);
    if (errorstate != HAL_SD_ERROR_NONE)
    {
        return errorstate;
    }

    /* CMD8: SEND_IF_COND: Command available only on V2.0 cards */
    errorstate = SDMMC_CmdOperCond(hsd->Instance);
    if (errorstate != HAL_SD_ERROR_NONE)
    {
        hsd->SdCard.CardVersion = CARD_V1_X;
        /* CMD0: GO_IDLE_STATE */
        errorstate = SDMMC_CmdGoIdleState(hsd->Instance);
        if (errorstate != HAL_SD_ERROR_NONE)
        {
            return errorstate;
        }
    }
    else
    {
        hsd->SdCard.CardVersion = CARD_V2_X;
    }

    if (hsd->SdCard.CardVersion == CARD_V2_X)
    {
        /* SEND CMD55 APP_CMD with RCA as 0 */
        errorstate = SDMMC_CmdAppCommand(hsd->Instance, 0);
        if (errorstate != HAL_SD_ERROR_NONE)
        {
            return HAL_SD_ERROR_UNSUPPORTED_FEATURE;
        }
    }
    /* SD CARD */
    /* Send ACMD41 SD_APP_OP_COND with Argument 0x80100000 */
    while ((count < SDMMC_MAX_VOLT_TRIAL) && (validvoltage == 0U))
    {
        /* SEND CMD55 APP_CMD with RCA as 0 */
        errorstate = SDMMC_CmdAppCommand(hsd->Instance, 0);
        if (errorstate != HAL_SD_ERROR_NONE)
        {
            return errorstate;
        }

        /* Send CMD41 */
        errorstate = SDMMC_CmdAppOperCommand(hsd->Instance,
                                             SDMMC_VOLTAGE_WINDOW_SD | SDMMC_HIGH_CAPACITY |
                                               SD_SWITCH_1_8V_CAPACITY);
        if (errorstate != HAL_SD_ERROR_NONE)
        {
            return HAL_SD_ERROR_UNSUPPORTED_FEATURE;
        }

        /* Get command response */
        response = SDMMC_GetResponse(hsd->Instance, SDMMC_RESP1);

        /* Get operating voltage*/
        validvoltage = (((response >> 31U) == 1U) ? 1U : 0U);

        count++;
    }

    if (count >= SDMMC_MAX_VOLT_TRIAL)
    {
        return HAL_SD_ERROR_INVALID_VOLTRANGE;
    }

    if ((response & SDMMC_HIGH_CAPACITY) ==
        SDMMC_HIGH_CAPACITY) /* (response &= SD_HIGH_CAPACITY) */
    {
        hsd->SdCard.CardType = CARD_SDHC_SDXC;
#if defined(STM32L4P5xx) || defined(STM32L4Q5xx) || defined(STM32L4R5xx) ||                        \
  defined(STM32L4R7xx) || defined(STM32L4R9xx) || defined(STM32L4S5xx) || defined(STM32L4S7xx) ||  \
  defined(STM32L4S9xx)
        if (hsd->Init.Transceiver == SDMMC_TRANSCEIVER_ENABLE)
        {
            if ((response & SD_SWITCH_1_8V_CAPACITY) == SD_SWITCH_1_8V_CAPACITY)
            {
                hsd->SdCard.CardSpeed = CARD_ULTRA_HIGH_SPEED;

                /* Start switching procedue */
                hsd->Instance->POWER |= SDMMC_POWER_VSWITCHEN;

                /* Send CMD11 to switch 1.8V mode */
                errorstate = SDMMC_CmdVoltageSwitch(hsd->Instance);
                if (errorstate != HAL_SD_ERROR_NONE)
                {
                    return errorstate;
                }

