smartel99/NilaiTFO/bsp/stm32l4xx_hal_sd.cpp
                /* Check to CKSTOP */
                while ((hsd->Instance->STA & SDMMC_FLAG_CKSTOP) != SDMMC_FLAG_CKSTOP)
                {
                    if ((HAL_GetTick() - tickstart) >= SDMMC_DATATIMEOUT)
                    {
                        return HAL_SD_ERROR_TIMEOUT;
                    }
                }

                /* Clear CKSTOP Flag */
                hsd->Instance->ICR = SDMMC_FLAG_CKSTOP;

                /* Check to BusyD0 */
                if ((hsd->Instance->STA & SDMMC_FLAG_BUSYD0) != SDMMC_FLAG_BUSYD0)
                {
                    /* Error when activate Voltage Switch in SDMMC Peripheral */
                    return SDMMC_ERROR_UNSUPPORTED_FEATURE;
                }
                else
                {
                    /* Enable Transceiver Switch PIN */
#if defined(USE_HAL_SD_REGISTER_CALLBACKS) && (USE_HAL_SD_REGISTER_CALLBACKS == 1U)
                    hsd->DriveTransceiver_1_8V_Callback(SET);
#else
                    HAL_SDEx_DriveTransceiver_1_8V_Callback(SET);
#endif

                    /* Switch ready */
                    hsd->Instance->POWER |= SDMMC_POWER_VSWITCH;

                    /* Check VSWEND Flag */
                    while ((hsd->Instance->STA & SDMMC_FLAG_VSWEND) != SDMMC_FLAG_VSWEND)
                    {
                        if ((HAL_GetTick() - tickstart) >= SDMMC_DATATIMEOUT)
                        {
                            return HAL_SD_ERROR_TIMEOUT;
                        }
                    }

                    /* Clear VSWEND Flag */
                    hsd->Instance->ICR = SDMMC_FLAG_VSWEND;

                    /* Check BusyD0 status */
                    if ((hsd->Instance->STA & SDMMC_FLAG_BUSYD0) == SDMMC_FLAG_BUSYD0)
                    {
                        /* Error when enabling 1.8V mode */
                        return HAL_SD_ERROR_INVALID_VOLTRANGE;
                    }
                    /* Switch to 1.8V OK */

                    /* Disable VSWITCH FLAG from SDMMC Peripheral */
                    hsd->Instance->POWER = 0x13U;

                    /* Clean Status flags */
                    hsd->Instance->ICR = 0xFFFFFFFFU;
                }
            }
        }
#endif /* STM32L4P5xx || STM32L4Q5xx || STM32L4R5xx || STM32L4R7xx || STM32L4R9xx || STM32L4S5xx   \
          || STM32L4S7xx || STM32L4S9xx */
    }
    else
    {
        hsd->SdCard.CardType = CARD_SDSC;
    }


    return HAL_SD_ERROR_NONE;
}

/**
 * @brief  Turns the SDMMC output signals off.
 * @param  hsd Pointer to SD handle
 * @retval None
 */
static void SD_PowerOFF(SD_HandleTypeDef* hsd)
{
    /* Set Power State to OFF */
    (void)SDMMC_PowerState_OFF(hsd->Instance);
}

/**
 * @brief  Send Status info command.
 * @param  hsd pointer to SD handle
 * @param  pSDstatus Pointer to the buffer that will contain the SD card status
 *         SD Status register)
 * @retval error state
 */
static uint32_t SD_SendSDStatus(SD_HandleTypeDef* hsd, uint32_t* pSDstatus)
{
    SDMMC_DataInitTypeDef config;
    uint32_t              errorstate;
    uint32_t              tickstart = HAL_GetTick();
    uint32_t              count;
    uint32_t*             pData = pSDstatus;

    /* Check SD response */
    if ((SDMMC_GetResponse(hsd->Instance, SDMMC_RESP1) & SDMMC_CARD_LOCKED) == SDMMC_CARD_LOCKED)
    {
        return HAL_SD_ERROR_LOCK_UNLOCK_FAILED;
    }

    /* Set block size for card if it is not equal to current block size for card */
    errorstate = SDMMC_CmdBlockLength(hsd->Instance, 64U);
    if (errorstate != HAL_SD_ERROR_NONE)
    {
        hsd->ErrorCode |= HAL_SD_ERROR_NONE;
        return errorstate;
    }

    /* Send CMD55 */
    errorstate = SDMMC_CmdAppCommand(hsd->Instance, (uint32_t)(hsd->SdCard.RelCardAdd << 16U));
    if (errorstate != HAL_SD_ERROR_NONE)
    {
        hsd->ErrorCode |= HAL_SD_ERROR_NONE;
        return errorstate;
    }

    /* Configure the SD DPSM (Data Path State Machine) */
    config.DataTimeOut   = SDMMC_DATATIMEOUT;
    config.DataLength    = 64U;
    config.DataBlockSize = SDMMC_DATABLOCK_SIZE_64B;
    config.TransferDir   = SDMMC_TRANSFER_DIR_TO_SDMMC;
    config.TransferMode  = SDMMC_TRANSFER_MODE_BLOCK;
    config.DPSM          = SDMMC_DPSM_ENABLE;
    (void)SDMMC_ConfigData(hsd->Instance, &config);

    /* Send ACMD13 (SD_APP_STAUS)  with argument as card's RCA */
    errorstate = SDMMC_CmdStatusRegister(hsd->Instance);
    if (errorstate != HAL_SD_ERROR_NONE)
    {
        hsd->ErrorCode |= HAL_SD_ERROR_NONE;
        return errorstate;
    }

    /* Get status data */
#if defined(STM32L4P5xx) || defined(STM32L4Q5xx) || defined(STM32L4R5xx) ||                        \
  defined(STM32L4R7xx) || defined(STM32L4R9xx) || defined(STM32L4S5xx) || defined(STM32L4S7xx) ||  \
  defined(STM32L4S9xx)
    while (!__HAL_SD_GET_FLAG(hsd,
                              SDMMC_FLAG_RXOVERR | SDMMC_FLAG_DCRCFAIL | SDMMC_FLAG_DTIMEOUT |
                                SDMMC_FLAG_DATAEND))
#else
    while (!__HAL_SD_GET_FLAG(hsd,
                              SDMMC_FLAG_RXOVERR | SDMMC_FLAG_DCRCFAIL | SDMMC_FLAG_DTIMEOUT |
                                SDMMC_FLAG_DBCKEND))
#endif /* STM32L4P5xx || STM32L4Q5xx || STM32L4R5xx || STM32L4R7xx || STM32L4R9xx || STM32L4S5xx   \
          || STM32L4S7xx || STM32L4S9xx */
    {
        if (__HAL_SD_GET_FLAG(hsd, SDMMC_FLAG_RXFIFOHF))
        {
            for (count = 0U; count < 8U; count++)
            {
                *pData = SDMMC_ReadFIFO(hsd->Instance);
                pData++;
            }
        }

        if ((HAL_GetTick() - tickstart) >= SDMMC_DATATIMEOUT)
        {
            return HAL_SD_ERROR_TIMEOUT;
        }
    }

    if (__HAL_SD_GET_FLAG(hsd, SDMMC_FLAG_DTIMEOUT))
    {
        return HAL_SD_ERROR_DATA_TIMEOUT;
    }
    else if (__HAL_SD_GET_FLAG(hsd, SDMMC_FLAG_DCRCFAIL))
    {
        return HAL_SD_ERROR_DATA_CRC_FAIL;
    }
    else if (__HAL_SD_GET_FLAG(hsd, SDMMC_FLAG_RXOVERR))
    {
        return HAL_SD_ERROR_RX_OVERRUN;
    }
    else
    {
        /* Nothing to do */
    }

#if defined(STM32L4P5xx) || defined(STM32L4Q5xx) || defined(STM32L4R5xx) ||                        \
  defined(STM32L4R7xx) || defined(STM32L4R9xx) || defined(STM32L4S5xx) || defined(STM32L4S7xx) ||  \
  defined(STM32L4S9xx)
    while ((__HAL_SD_GET_FLAG(hsd, SDMMC_FLAG_DPSMACT)))
#else
    while ((__HAL_SD_GET_FLAG(hsd, SDMMC_FLAG_RXDAVL)))
#endif /* STM32L4P5xx || STM32L4Q5xx || STM32L4R5xx || STM32L4R7xx || STM32L4R9xx || STM32L4S5xx   \
          || STM32L4S7xx || STM32L4S9xx */
    {
        *pData = SDMMC_ReadFIFO(hsd->Instance);
        pData++;

        if ((HAL_GetTick() - tickstart) >= SDMMC_DATATIMEOUT)
        {
            return HAL_SD_ERROR_TIMEOUT;
        }
    }

    /* Clear all the static status flags*/
    __HAL_SD_CLEAR_FLAG(hsd, SDMMC_STATIC_DATA_FLAGS);

    return HAL_SD_ERROR_NONE;
}

/**
 * @brief  Returns the current card's status.
 * @param  hsd Pointer to SD handle
 * @param  pCardStatus pointer to the buffer that will contain the SD card
 *         status (Card Status register)
 * @retval error state
 */
static uint32_t SD_SendStatus(SD_HandleTypeDef* hsd, uint32_t* pCardStatus)
{
    uint32_t errorstate;

