smartel99/NilaiTFO/bsp/stm32l4xx_hal_sd.cpp
    tmp           = hsd->pTxBuffPtr;
    dataremaining = hsd->TxXferSize;

    if (dataremaining > 0U)
    {
        /* Write data to SDMMC Tx FIFO */
        for (count = 0U; count < 8U; count++)
        {
            data = (uint32_t)(*tmp);
            tmp++;
            dataremaining--;
            data |= ((uint32_t)(*tmp) << 8U);
            tmp++;
            dataremaining--;
            data |= ((uint32_t)(*tmp) << 16U);
            tmp++;
            dataremaining--;
            data |= ((uint32_t)(*tmp) << 24U);
            tmp++;
            dataremaining--;
            (void)SDMMC_WriteFIFO(hsd->Instance, &data);
        }

        hsd->pTxBuffPtr = tmp;
        hsd->TxXferSize = dataremaining;
    }
}

#if defined(STM32L4P5xx) || defined(STM32L4Q5xx) || defined(STM32L4R5xx) ||                        \
  defined(STM32L4R7xx) || defined(STM32L4R9xx) || defined(STM32L4S5xx) || defined(STM32L4S7xx) ||  \
  defined(STM32L4S9xx)
/**
 * @brief  Switches the SD card to High Speed mode.
 *         This API must be used after "Transfer State"
 * @note   This operation should be followed by the configuration
 *         of PLL to have SDMMCCK clock between 50 and 120 MHz
 * @param  hsd SD handle
 * @retval SD Card error state
 */
uint32_t SD_HighSpeed(SD_HandleTypeDef* hsd)
{
    uint32_t              errorstate = HAL_SD_ERROR_NONE;
    SDMMC_DataInitTypeDef sdmmc_datainitstructure;
    uint32_t              SD_hs[16] = {0};
    uint32_t              count, loop = 0;
    uint32_t              Timeout = HAL_GetTick();

    if (hsd->SdCard.CardSpeed == CARD_NORMAL_SPEED)
    {
        /* Standard Speed Card <= 12.5Mhz  */
        return HAL_SD_ERROR_REQUEST_NOT_APPLICABLE;
    }

    if (hsd->SdCard.CardSpeed == CARD_HIGH_SPEED)
    {
        /* Initialize the Data control register */
        hsd->Instance->DCTRL = 0;
        errorstate           = SDMMC_CmdBlockLength(hsd->Instance, 64U);

        if (errorstate != HAL_SD_ERROR_NONE)
        {
            return errorstate;
        }

        /* Configure the SD DPSM (Data Path State Machine) */
        sdmmc_datainitstructure.DataTimeOut   = SDMMC_DATATIMEOUT;
        sdmmc_datainitstructure.DataLength    = 64U;
        sdmmc_datainitstructure.DataBlockSize = SDMMC_DATABLOCK_SIZE_64B;
        sdmmc_datainitstructure.TransferDir   = SDMMC_TRANSFER_DIR_TO_SDMMC;
        sdmmc_datainitstructure.TransferMode  = SDMMC_TRANSFER_MODE_BLOCK;
        sdmmc_datainitstructure.DPSM          = SDMMC_DPSM_ENABLE;

        if (SDMMC_ConfigData(hsd->Instance, &sdmmc_datainitstructure) != HAL_OK)
        {
            return (HAL_SD_ERROR_GENERAL_UNKNOWN_ERR);
        }


        errorstate = SDMMC_CmdSwitch(hsd->Instance, SDMMC_SDR25_SWITCH_PATTERN);
        if (errorstate != HAL_SD_ERROR_NONE)
        {
            return errorstate;
        }

        while (!__HAL_SD_GET_FLAG(hsd,
                                  SDMMC_FLAG_RXOVERR | SDMMC_FLAG_DCRCFAIL | SDMMC_FLAG_DTIMEOUT |
                                    SDMMC_FLAG_DBCKEND | SDMMC_FLAG_DATAEND))
        {
            if (__HAL_SD_GET_FLAG(hsd, SDMMC_FLAG_RXFIFOHF))
            {
                for (count = 0U; count < 8U; count++)
                {
                    SD_hs[(8U * loop) + count] = SDMMC_ReadFIFO(hsd->Instance);
                }
                loop++;
            }

            if ((HAL_GetTick() - Timeout) >= SDMMC_DATATIMEOUT)
            {
                hsd->ErrorCode = HAL_SD_ERROR_TIMEOUT;
                hsd->State     = HAL_SD_STATE_READY;
                return HAL_SD_ERROR_TIMEOUT;
            }
        }

        if (__HAL_SD_GET_FLAG(hsd, SDMMC_FLAG_DTIMEOUT))
        {
            __HAL_SD_CLEAR_FLAG(hsd, SDMMC_FLAG_DTIMEOUT);

            return errorstate;
        }
        else if (__HAL_SD_GET_FLAG(hsd, SDMMC_FLAG_DCRCFAIL))
        {
            __HAL_SD_CLEAR_FLAG(hsd, SDMMC_FLAG_DCRCFAIL);

            errorstate = SDMMC_ERROR_DATA_CRC_FAIL;

            return errorstate;
        }
        else if (__HAL_SD_GET_FLAG(hsd, SDMMC_FLAG_RXOVERR))
        {
            __HAL_SD_CLEAR_FLAG(hsd, SDMMC_FLAG_RXOVERR);

            errorstate = SDMMC_ERROR_RX_OVERRUN;

            return errorstate;
        }
        else
        {
            /* No error flag set */
        }

        /* Clear all the static flags */
        __HAL_SD_CLEAR_FLAG(hsd, SDMMC_STATIC_DATA_FLAGS);

        /* Test if the switch mode HS is ok */
        if ((((uint8_t*)SD_hs)[13] & 2U) != 2U)
        {
            errorstate = SDMMC_ERROR_UNSUPPORTED_FEATURE;
        }
    }

    return errorstate;
}

/**
 * @brief  Switches the SD card to Ultra High Speed mode.
 *         This API must be used after "Transfer State"
 * @note   This operation should be followed by the configuration
 *         of PLL to have SDMMCCK clock between 50 and 120 MHz
 * @param  hsd SD handle
 * @retval SD Card error state
 */
static uint32_t SD_UltraHighSpeed(SD_HandleTypeDef* hsd)
{
    uint32_t              errorstate = HAL_SD_ERROR_NONE;
    SDMMC_DataInitTypeDef sdmmc_datainitstructure;
    uint32_t              SD_hs[16] = {0};
    uint32_t              count, loop = 0;
    uint32_t              Timeout = HAL_GetTick();

    if (hsd->SdCard.CardSpeed == CARD_NORMAL_SPEED)
    {
        /* Standard Speed Card <= 12.5Mhz  */
        return HAL_SD_ERROR_REQUEST_NOT_APPLICABLE;
    }

    if ((hsd->SdCard.CardSpeed == CARD_ULTRA_HIGH_SPEED) &&
        (hsd->Init.Transceiver == SDMMC_TRANSCEIVER_ENABLE))
    {
        /* Initialize the Data control register */
        hsd->Instance->DCTRL = 0;
        errorstate           = SDMMC_CmdBlockLength(hsd->Instance, 64U);

        if (errorstate != HAL_SD_ERROR_NONE)
        {
            return errorstate;
        }

        /* Configure the SD DPSM (Data Path State Machine) */
        sdmmc_datainitstructure.DataTimeOut   = SDMMC_DATATIMEOUT;
        sdmmc_datainitstructure.DataLength    = 64U;
        sdmmc_datainitstructure.DataBlockSize = SDMMC_DATABLOCK_SIZE_64B;
        sdmmc_datainitstructure.TransferDir   = SDMMC_TRANSFER_DIR_TO_SDMMC;
        sdmmc_datainitstructure.TransferMode  = SDMMC_TRANSFER_MODE_BLOCK;
        sdmmc_datainitstructure.DPSM          = SDMMC_DPSM_ENABLE;

